{
  "APP_NAME":"GreenCard Go!",
  "SIDEMENU_HOME":"HOME",
  "SIDEMENU_DISCLAIMER":"DISCLAIMER",
  "SIDEMENU_GENERAL_INSTRUCTIONS":"GENERAL INSTRUCTIONS",
  "SIDEMENU_ABOUT_US":"ABOUT US",
  "NAV_BUTTON_YES": "YES",
  "NAV_BUTTON_NEXT": "NEXT",
  "NAV_BUTTON_AGREE": "AGREE",
  "ERROR_D7": "Sorry, it's not possible to previously select that you will not be in-status (by the time the F2A petition's priority date is current) while now selecting that you will be in-status by the time the F1 petition's priority date is current (a much longer time period after).  Please try again and select No.",
  "ERROR_O1_O3": "It is not possible for options 1 and 3 to both be true. Please try again.",
  "ERROR_O5": "It is not possible for 'None of the above' and another option to both be true.  Please try again.",
  "ERROR_SELECT_OPTION": "Sorry, you must choose at least one option.",
  "ERROR_SELECT_UNDER_21": "Since you've selected that you're under 21, it's obviously not possible for you to have a child over 21.  Please try again.",
  "ERROR_FREE_APP": "Sorry but you need to purchase paid application to generate report.",
  "TEXT_HELPER_CLOSE": "Close",

  "DISCLAIMER":"<p><strong><span>DISCLAIMER:</span></strong></p><p><span>Information provided by this GreenCard Go! app on possible methods, if any, for you to obtain a \"green card\" in order to be a legal permanent resident of the United States is provided as legal information only. It is absolutely NOT intended to be legal advice. Every care and effort has been taken to ensure this app contains the latest and most accurate immigration information; however, G reenCard Go! makes no warranty or representation whatsoever, whether express or implied, as to the accuracy of such information. Any action you take or rely upon after using this app is your own responsibility and GreenCard Go! bears no responsibility or connection to such action. Consultation with a qualified immigration attorney is highly recommended for definitive advice and guidance for your immigration solutions and planning, such as with the Law Office of Larry L. Doan, GuruImmigration.com, in Los Angeles, California, the creator of this app.</span></p><p><span>Also, if you have ever been arrested, charged, convicted of a crime anywhere, deported or removed from the US, have multiple unlawful entries into the US, or have had an immigration history in the US but are now living outside, a consultation with an immigration attorney is absolutely a must, as this app only provides information as to what is possible for a person without these grounds of inadmissibility. With these grounds on your records, it still may be possible for you to obtain a green card but only after being approved for certain difficult waivers or pardons or upon satisfying other conditions. Only a qualified attorney can advise you on these steps.</span></p>",

  "GENERAL_INSTRUCTIONS":"<p><strong><span>GENERAL INSTRUCTIONS:</span></strong></p><p><span>This app is for those who are primarily interested in ways to immigrate permanently to the United States, that is, to obtain what is known as a \"green card.\" Whether you are already in the US or currently outside, obtaining a green card means that you are entitled to live and work permanently in this country. Although this app does cover some, it is less focused on non-permanent ways to visit or stay in the US as there are numerous such ways, which require a tremendous amount of information-gathering and analysis. Instead, we believe that users of this app are more interested in permanently immigrating to this country.</span></p><p><span>Note: This app is not intended for those who already have a green card, strangely enough that is a situation that we sometimes encounter when a person wants to \"check\" on how they obtained their card.</span></p>",

  "ABOUT_US": "<p><strong><span>ABOUT US:</span></strong></p><p><span>This app was created by the Law Office of Larry L. Doan, GuruImmigration.com, in Los Angeles, California, who provides it only as legal information and NOT as legal advice.</span></p>",

  "PDF_SUMMARY_TITLE": "Below are all the actual responses that you've inputted into the app and the action steps given:",
  "PDF_TEMP_ACTION_STEPS" : "These are the action steps you could take to stay temporarily in the US:",
  "PDF_ACTION_STEPS": "To summarize, these are the action steps you could take to obtain permanent residence in the US:",
  "PDF_STEPS_TEXT_CONSTANT_1": "- Because your parent had or will have a petition filed for them by their parent, sibling or employer, you can:  ",
  "PDF_STEPS_TEXT_CONSTANT_2": "- Because you had or will have a petition filed for you by your parent or sibling, you can:  ",
  "PDF_STEPS_TEXT_CONSTANT_3": "- Because you have a citizen sibling over 21, you can:  ",
  "PDF_STEPS_TEXT_CONSTANT_4": "- Because you have a job offer from a US employer willing to petition for a green card for you, you can:  ",
  "PDF_STEPS_TEXT_CONSTANT_5": "- Because you're under 21 and unmarried and your parent is a citizen or green card-holder, you can:  ",
  "PDF_STEPS_TEXT_CONSTANT_6": "- Because you have children, at least one of whom is or will be a citizen over 21, you can:  ",
  "PDF_STEPS_TEXT_CONSTANT_7": "- Because your spouse had or will have a petition filed for them by their parent, sibling or employer, you can:  ",
  "PDF_STEPS_TEXT_CONSTANT_8": "- Because you're married to a citizen or green-card holder, you can:  ",

  "D1_TITLE":"Are you currently in the US?",
  "D1_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;'You' means the person who is interested in immigrating to or being in the United States, and the following questions are from that person's point of view. &nbsp;If instead, you're the US citizen or green-card holder who's interested in sponsoring a relative, then the term 'you' in these questions are from your relative's point of view, not from yours.</span></p>",

  "D2_TITLE":"Were you a principal beneficiary or included as a derivative beneficiary on an old I-130, I-140 or labor certification filed on or before April 30, 2001?",
  "D2_TITLE_BODY":"<p><span>This means a close relative of yours (spouse, parent, child over 21, or sibling) who was a US citizen or green-card holder might have filed an I-130 petition for you&nbsp;<em><span>on or before</span></em>&nbsp;April 30, 2001&nbsp;to immigrate to the US , or an employer might have filed an I-140 petition or labor certification on or before that date&nbsp;for you to immigrate based on a job offer. &nbsp;In that case, you would be considered the '<em><span>principal beneficiary</span></em>.' &nbsp;However, even if that's not the case, if on April 30, 2001 you were the<em>&nbsp;</em><em><span>spouse or child under 21</span></em>&nbsp;of a person who had a petition or labor certification filed for them, then you would be included and considered a '<em><span>derivative beneficiary</span></em>.' &nbsp;In either case, please answer 'Yes.'</span></p>",

  "D3_TITLE":"Did you enter the US with inspection?",
  "D3_TITLE_BODY":"<p>You entered and actually passed through inspection by a US officer by presenting a nonimmigrant visa, visa waiver, other entry document, paroled in to the US, or even waved through by the officer. &nbsp;</p><p>If you entered illegally or without documents, please select 'No'.</p>",

  "D4_TITLE":"Are you still in-status?",
  "D4_TITLE_BODY":"The period of time you were given to stay in the US at the time of your entry or any later extension of time has not expired yet.",

  "D5_TITLE":"Did you enter with a nonimmigrant visa?",
  "D5_TITLE_BODY":"<p><span>A visa for&nbsp;<em><span>temporary</span></em>&nbsp;stay in the US originally obtained at the US consulate in your home country, such as B-1/B-2, E-1/E-2, F-1, H-1B, J-1, L-1, O-1, etc. &nbsp;It also includes the situation where you originally entered on a particular nonimmigrant visa type but successfully filed a change of status in the US to be in a different nonimmigrant visa type, e.g., entered on F-1 but now is H-1B. &nbsp;<em><span>Note:</span></em>&nbsp;&nbsp;this does&nbsp;<em><span>not</span></em>&nbsp;include you if you entered with visa waiver.</span></p>",

  "D6_TITLE":"At this point, if your spouse is not yet citizen, would he or she apply for citizenship if qualified to do so at that time (had green card for at least 5 years) or in the future?",
  "D6_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;because you entered the US with inspection, spouse having citizenship rather than just green card will allow you to obtain green card here without having to leave the US. &nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history</span></p>",

  "D8_TITLE":"Will parent have completed the citizenship process and become citizen before you turned 21?",
  "D8_TITLE_BODY": "If your parent becomes a citizen before you turn 21, you will be considered an immediate relative and so if there's already an I-130 petition filed for you, it would immediately have its priority date current.  If parent becomes citizen after you turn 21, you will be considered in the F1 category (unmarried son/daughter 21 or over of citizen) and must wait until the I-130's priority date is current.",

  "D9_TITLE":"Once I-130 is approved and has priority date current under option A above, will you still be under 21 by that time?",

  "D10_TITLE":"At this point, if your parent is not yet citizen, would he or she apply for citizenship if qualified to do so at that time (had green card for at least 5 years, or 3 in some cases) or in the future?",
  "D10_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;because you entered the US with inspection, parent having citizenship rather than just green card will allow you to obtain green card here without having to leave the US. &nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history.</span><span><br /> <br /> <em><span>Warning:</span></em><span>&nbsp;&nbsp;If you are close to 21 years of age, it may not be a good idea for your parent to file for citizenship unless it's reasonably sure that your parent's N-400 application will be approved before you turn 21. &nbsp;The reason is because if your parent becomes a citizen after you've turned 21, you will be automatically switched into the F1 category,&nbsp;which usually is much slower than your F2A category (children under 21 and spouses of green-card holders).</span></span></p>",

  "D11_TITLE":"Do you have any US citizen sibling 21 or over?",

  "D12_TITLE":"Are you interested in the remaining methods, if any, to obtain a green card? (even if you've arrived at this step after having been recommended to file an I-485 for green card)",
  "D12_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;these other methods may be slower or faster than the method(s) that have been recommended for you so far. &nbsp;It's important to see what your options are, however.</span></p>",

  "D13_TITLE":"Are you interested in other methods (not green card or necessarily permanent), if any, to remain in the US?",
  "D13_TITLE_BODY":"Methods that may not necessarily result in permanent stay in US.",

  "D14_TITLE":"Is your effective age just computed under 21?",

  "M1_QUES1_TITLE":"Please choose as many of these that are true about yourself (or None):",
  "M3_QUES1_TITLE":"Please choose as many of these that are true about yourself (or None):",
  "QUES1_TITLE":"Please choose as many of these that are true about yourself (or None):",
  "Option1": "I'm married",
  "Option2": "I have children",
  "Option3": "I'm under 21 and unmarried",
  "Option4": "I have a job offer from a US employer willing to petition for a green card for me even if it takes years",
  "Option5": "None of the above",

  "OC1_TITLE":"Since you are married, please choose one that is true:",
  "OC1_OPTIONA":"My spouse is a US citizen",
  "OC1_OPTIONB":"My spouse has a green card",
  "OC1_OPTIONC":"My spouse is neither citizen nor has green card",

  "OC2_TITLE":"Since you have children, please choose one that is true:",
  "OC2_OPTIONA":"At least one child is a US citizen 21 or over",
  "OC2_OPTIONB":"At least one child is a citizen but no such child is 21 yet",
  "OC2_OPTIONC":"No child is a citizen but  at least one child has a green card",
  "OC2_OPTIOND":"No child is a citizen nor has green card",
  "OC2_TITLE_NOTE": "<p><em><span>Note</span></em><span>: &nbsp;a \"child\" can also include your stepchild, as long as you were married to his or her parent before the stepchild turned 18.</span></p>",

  "OC3_TITLE":"Since you are under 21 and unmarried, please choose one that is true:",
  "OC3_OPTIONA":"I have a US citizen parent",
  "OC3_OPTIONB":"I have a parent with green card",
  "OC3_OPTIONC":"I have no citizen nor green card parent",
  "OC3_TITLE_NOTE": "<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" can also include your step-parent, as long as he or she was married to your parent before you turned 18.</span></p>",

  "H1_TITLE":"Please choose from the following options:",
  "H1_OPTIONA": "Have spouse file I-130 petition for you with USCIS (uscis.gov) and wait until it's approved and priority date current (meaning a visa number has become available for you on the visa waiting list under the F2A category, which can be checked in the Visa Bulletin at http://travel.state.gov/content/visas/en/law-and-policy/bulletin.html).  If such an I-130 already filed, wait until it's approved and priority date current.",
  "H1_OPTIONB": "Have spouse file N-400 application to become US citizen if he or she had green card for at least 5 years and wait until N-400 is approved and spouse is citizen.",
  "H1_TITLE_NOTE": "<p><em><span>Note: &nbsp;</span></em><span>your spouse must be at least 18 to be able to petition for you.</span></p><p><em><span><br /> </span></em><span>Which option to choose depends on how soon your spouse is eligible to file for citizenship. &nbsp;If spouse is eligible right now to file for citizenship (usually after 5 years of having green card), then usually&nbsp;the second option (file for N-400) will be faster as it takes only about 6 months on average for the N-400 to be approved, which allows you to start the green card process immediately afterward. &nbsp;Whereas, it's taking about a year or two for a new I-130 petition filed by your green-card spouse to have its priority date current (having a visa available for you to immigrate).&nbsp;</span></p><p><span>However, if it's been a while since an I-130 was already filed for you by your green-card spouse (even before running this app) and it's simply waiting for its priority date to be current, it&nbsp;might not be too long until the priority date is current so the first option would be better and should be chosen.</span><span><br /> <br /> <span>Also, if you have children under 21 and unmarried who are also your spouse's children or his or her stepchildren who were under 18 when you married your spouse,&nbsp;they can be included in your spouse's petition for you, whereas if your spouse is a citizen, he or she has to file separate petitions for you and for each of your children (and sometimes the spouse is not willing to do that).</span></span></p>",

  "H2_TITLE":"Sorry:  it's not possible to immigrate through your children.",

  "H3_TITLE":"Wait until child turns 21.",

  "H4_TITLE":"Have child file N-400 application to become US citizen as soon as possible if he or she is 18 or over and had green card for at least 5 years (3 in some cases).  Then after it's approved, wait (if necessary) until child is 21 or over.",

  "H5_TITLE":"Please choose from the following options:",
  "H5_OPTIONA":"Have parent file I-130 petition for you under the F2A category and wait until it's approved and priority date current; or if such an I-130 already filed, wait until it's approved and priority date current.",
  "H5_OPTIONB":"Have parent file N-400 application when you're still under 21 to become US citizen if he or she had green card for at least 5 years (3 in some cases) and wait until N-400 is approved and parent is citizen.",
  "H5_TITLE_NOTE": "<p><em>Note:&nbsp;</em>F2A category = unmarried children (under 21) and spouses of green-card holders.<br /><br />Which option to choose depends on how soon your parent is eligible to file for citizenship. &nbsp;If parent is eligible right now to file for citizenship (usually after 5 years of having green card), then usually&nbsp;the second option (file for N-400) will be faster as it takes only about 6 months on average for the N-400 to be approved, which allows you to start the green card process immediately afterward. &nbsp;Whereas, it's taking about a year or two for a new I-130 petition filed by your green-card parent to have its priority date current under the F2A category (having a visa available for you to immigrate).&nbsp;<br /><br />However, if it's been a while since an I-130 was already filed for you by your green-card parent (even before running this app) and it's simply waiting for its priority date to be current, it&nbsp;might not be too long until the priority date is current so the first option would be better and should be chosen.<br /><br /><em>Warning:</em>&nbsp;&nbsp;If you are close to 21 years of age, it might not be a good idea for your parent to file for citizenship unless it's reasonably sure that your parent's N-400 application will be approved before you turn 21. &nbsp;The reason is because if your parent becomes a citizen after you've turned 21, you will be automatically switched into the F1 category, which usually is years slower than your F2A category. Another consideration is, if you have children under 21 and unmarried, they can be included in your green-card parent's petition for you under the F2A category and can immigrate with you, whereas if your parent becomes a citizen before you turn 21, your children cannot be included in the petition for you.</p>",

  "H6_TITLE":"Have parent file N-400 application when you're still under 21 to become US citizen.",

  "H7_TITLE":"Have such sibling file I-130 petition for you under the F4 category and wait until it's approved and priority date current; or if I-130 already filed but not current, wait until it's approved and priority date current.",
  "H7_TITLE_BODY": "<p><span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.&nbsp;</span><span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and your sibling here exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span></span></p>",

  "H8_TITLE":"Since you have a job offer from a US employer, have employer file labor certification for you (if necessary and one hasn't been filed yet) and get that certified, then file I-140 petition for you and wait until it's approved and priority date current; or if I-140 already filed but not current, wait until it's approved and priority date current. ",
  "H8_TITLE_BODY": "<p><span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.&nbsp;<br /> But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and the employer here exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span></p>",

  "H9_TITLE":"Compute your 'effective age' as follows:  (1) determine your age on the date when a visa number became or will become available for you under the F2A category  (which is the date in the Visa Bulletin when your petition's priority date became or will become current or the petition's approval date itself, whichever is later), then (2) reduce that age by the number of days the petition was or will be pending.",

  "OV0_TITLE":"File I-539 to extend your status on same visa or to change status to another visa category, if there were exceptional circumstances and not been out-of-status for too long.",
  "OV0_TITLE_BODY":"This is only a temporary strategy to extend your stay in the US while waiting for the green card process to complete so you can remain permanently.",

  "OV1_TITLE":"Your citizen spouse, child, or parent, depending on who’s being discussed, files an I-130 petition for you (unless one's already been filed) concurrently with you filing I-485 application for green card.",

  "OV2_TITLE":"File I-485 and I-485A applications for green card.  Your unmarried children under 21 (if any) are also eligible to file the I-485 and possibly the I-485A (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",
  "OV2_TITLE_BODY":"<p><em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must take the step to file the applications&nbsp;<em><span>within one year after</span></em>&nbsp;the&nbsp;date when a visa number became or will become available for you under the F2A category.</span></p>",

  "OV3_TITLE":"Your citizen spouse, child, or parent, depending on who’s being discussed, files an I-130 petition for you (unless one's already been filed) concurrently with you filing I-485 and I-485A applications for green card.",

  "OV4_TITLE":"File I-485 and I-485A applications for green card.  Your spouse (if any) and your unmarried children under 21 (if any) are also eligible to file the I-485 and possibly the I-485A (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",

  "OV5_TITLE":"Have spouse file N-400 application to become US citizen.  Then after it's approved, you file I-485 application for green card.",

  "OV6_TITLE":"Since you are out of status/unlawfully present in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card).  If out of status/unlawfully present for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval before going back to home country. \nYour unmarried children under 21 (if any), who are also your spouse's children or his or her stepchildren who were under 18 when you married your spouse, are also eligible to go through the same process, and must file the I-601A or I-601 waiver, too, if they were out of status/unlawfully present for more than 180 days in the US.",
  "OV6_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em>not</em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.). &nbsp;Same thing applies to your children.</span></p>",

  "OV7_TITLE":"Have your citizen child 21 or over file I-130 petition for you (unless one's already been filed) and wait for approval.  Then, since you are out of status/unlawfully present in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card).  If out of status/unlawfully present for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval if have citizen/green card parent or spouse, before going back to home country.  If no such parent or spouse, will be subject to 3- or 10-year bar.",

  "OV8_TITLE":"Since you are out of status/unlawfully present in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card).  If out of status/unlawfully present for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval before going back to home country. \nYour unmarried children under 21 (if any) are also eligible to go through the same process, and must file the I-601A or I-601 waiver, too, if they were out of status/unlawfully present for more than 180 days in the US.",
  "OV8_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em><span>not</span></em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.). &nbsp;Same thing applies to your children.</span><span><br /> <br /> <em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must take the step to obtain the immigrant visa&nbsp;<em><span>within one year after</span></em>&nbsp;the&nbsp;date when a visa number became or will become available for you under the F2A category.</span></span></p>",

  "OV9_TITLE":"Since you are out of status/unlawfully present in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card).  If out of status for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval if have citizen/green card parent or spouse, before going back to home country.  If no such parent or spouse, will be subject to 3- or 10-year bar. \nYour spouse (if any) and your unmarried children under 21 (if any) will also be eligible to go through the same process, and must file the I-601A or I-601 waiver, too, if they were out of status/unlawfully present for more than 180 days in the US.",


  "M1_D1_TITLE":"Did you enter with a nonimmigrant visa?",
  "M1_D1_TITLE_BODY":"<p><span>A visa for&nbsp;<em><span>temporary</span></em>&nbsp;stay in the US originally obtained at the US consulate in your home country, such as B-1/B-2, E-1/E-2, F-1, H-1B, J-1, L-1, O-1, etc. &nbsp;It also includes the situation where you originally entered on a particular nonimmigrant visa type but successfully filed a change of status in the US to be in a different nonimmigrant visa type, e.g., entered on F-1 but now is H-1B. &nbsp;<em><span>Note:</span></em>&nbsp;&nbsp;this does&nbsp;<em><span>not</span></em>&nbsp;include you if you entered with visa waiver.</span></p>",

  "M1_D2_TITLE":"Were you a principal beneficiary or included as a derivative beneficiary on an old I-130, I-140 or labor certification filed on or before April 30, 2001?",
  "M1_D2_TITLE_BODY":"<p><span>This means a close relative of yours (spouse, parent, child over 21, or sibling) who was a US citizen or green-card holder might have filed an I-130 petition for you&nbsp;<em><span>on or before</span></em>&nbsp;April 30, 2001&nbsp;to immigrate to the US, or an employer might have filed an I-140 petition or labor certification on or before that date&nbsp;for you to immigrate based on a job offer. &nbsp;In that case, you would be considered the '<em><span>principal beneficiary</span></em>.' &nbsp;However, even if that's not the case, if on April 30, 2001 you were the<em>&nbsp;</em><em><span>spouse or child under 21</span></em>&nbsp;of a person who had a petition or labor certification filed for them, then you would be included and considered a '<em><span>derivative beneficiary</span></em>.' &nbsp;In either case, please answer 'Yes.'</span></p>",

  "M1_D3_TITLE":"Once I-130 is approved and has priority date current under option A above, if your spouse will not yet be citizen, will you have maintained status in US by that time?",
  "M1_D3_TITLE_BODY":"<p><em><span>Note:</span></em><span>&nbsp; It may take some time (a year or two in this category) for the priority date to be current, so you should plan ahead and strive to take steps to maintain legal status in the US on your existing nonimmigrant visa or change to another type of visa. &nbsp;If you go out of status, you may have to return to your home country to obtain green card and risk the 10-year bar, unless your spouse can naturalize to a US citizen.</span></p>",

  "M1_D4_TITLE":"Since you will be out of status by that time, if your spouse will not yet be citizen, will he or she apply for citizenship if qualified to do so at that time (had green card for at least 5 years) or in the future?",
  "M1_D4_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;because you entered the US with inspection, spouse having citizenship rather than just green card will allow you to obtain green card here without having to leave the US. &nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history.</span></p>",

  "M1_D5_TITLE":"Will parent have completed the citizenship process and become citizen before you turned 21?",
  "M1_D5_TITLE_BODY":"<p><span>If your parent becomes a citizen before you turn 21, you will be considered an immediate relative and so if there's already an I-130 petition filed for you, it would immediately have its priority date current. &nbsp;If parent becomes citizen after you turn 21, you will be considered in the F1 category (unmarried son/daughter 21 or over of citizen) and must wait until the I-130's priority date is current.</span></p>",

  "M1_D6_TITLE":"Once I-130 is approved and has priority date current under option A above, will you still be under 21 by that time?",

  "M1_D7_TITLE":"Will you have maintained status in the US by that time?",

  "M1_D8_TITLE":"Since you will be out of status by that time, if your parent is not yet citizen, would he or she apply for citizenship if qualified to do so at that time (had green card for at least 5 years, or 3 in some cases) or in the future?",
  "M1_D8_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;because you entered the US with inspection, parent having citizenship rather than just green card will allow you to obtain green card here without having to leave the US. &nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history.</span><span><br /> <br /> <em><span>Warning:</span></em><span>&nbsp;&nbsp;If you are close to 21 years of age, it may not be a good idea for your parent to file for citizenship unless it's reasonably sure that your parent's N-400 application will be approved before you turn 21. &nbsp;The reason is because if your parent becomes a citizen after you've turned 21, you will be automatically switched into the F1 category,&nbsp;which usually is much slower than your F2A category (children under 21 and spouses of green-card holders).</span></span></p>",

  "M1_D9_TITLE":"Do you have any US citizen sibling 21 or over?",

  "M1_D10_TITLE":"Are you interested in the remaining methods, if any, to obtain a green card? (even if you've arrived at this step after having been recommended to file an I-485 for green card)",
  "M1_D10_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;these other methods may be slower or faster than the method(s) that have been recommended for you so far. &nbsp;It's important to see what your options are, however.</span></p>",

  "M1_D11_TITLE":"Are you interested in other methods (not green card or necessarily permanent), if any, to remain in the US?",
  "M1_D11_TITLE_BODY":"Methods that may not necessarily result in permanent stay in US.",

  "M1_D12_TITLE":"Is your effective age just computed under 21?",


  "M1_QUES1_TITLE":"Please choose as many of these that are true about yourself (or None):",

  "M1_OC1_TITLE":"Since you are married, please choose one that is true:",
  "M1_OC1_OPTIONA":"My spouse is a US citizen",
  "M1_OC1_OPTIONB":"My spouse has a green card",
  "M1_OC1_OPTIONC":"My spouse is neither citizen nor has green card",

  "M1_OC2_TITLE":"Since you have children, please choose one that is true:",
  "M1_OC2_OPTIONA":"At least one child is a US citizen 21 or over",
  "M1_OC2_OPTIONB":"At least one child is a citizen but no such child is 21 yet",
  "M1_OC2_OPTIONC":"No child is a citizen but  at least one child has a green card",
  "M1_OC2_OPTIOND":"No child is a citizen nor has green card",
  "M1_OC2_TITLE_NOTE":"<p><em><span>Note</span></em><span>: &nbsp;a \"child\" can also include your stepchild, as long as you were married to his or her parent before the stepchild turned 18.</span></p>",

  "M1_OC3_TITLE":"Since you are under 21 and unmarried, please choose one that is true:",
  "M1_OC3_OPTIONA":"I have a US citizen parent",
  "M1_OC3_OPTIONB":"I have a parent with green card",
  "M1_OC3_OPTIONC":"I have no citizen nor green card parent",
  "M1_OC3_TITLE_NOTE":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" can also include your step-parent, as long as he or she was married to your parent before you turned 18.</span></p>",

  "M1_H1_TITLE":"Please choose from the following options:",
  "M1_H1_OPTIONA":"Have spouse file I-130 petition for you and wait until it's approved and priority date current; or if such an I-130 already filed, wait until it's approved and priority date current.",
  "M1_H1_OPTIONB":"Have spouse file N-400 application to become US citizen if he or she had green card for at least 5 years and wait until N-400 is approved and spouse is citizen.",
  "M1_H1_TITLE_NOTE":"<p><em><span>Note: &nbsp;</span></em><span>your spouse must be at least 18 to be able to petition for you.</span></p><p><em><span><br /> </span></em><span>Which option to choose depends on how soon your spouse is eligible to file for citizenship. &nbsp;If spouse is eligible right now to file for citizenship (usually after 5 years of having green card), then usually&nbsp;the second option (file for N-400) will be faster as it takes only about 6 months on average for the N-400 to be approved, which allows you to start the green card process immediately afterward. &nbsp;Whereas, it's taking about a year or two for a new I-130 petition filed by your green-card spouse to have its priority date current (having a visa available for you to immigrate).&nbsp;</span></p><p><span>However, if it's been a while since an I-130 was already filed for you by your green-card spouse (even before running this app) and it's simply waiting for its priority date to be current, it&nbsp;might not be too long until the priority date is current so the first option would be better and should be chosen.</span></p><p><span><br /> <span>Also, if you have children under 21 and unmarried who are also your spouse's children or his or her stepchildren who were under 18 when you married your spouse,&nbsp;they can be included in your spouse's petition for you, whereas if your spouse is a citizen, he or she has to file separate petitions for you and for each of your children (and sometimes the spouse is not willing to do that).</span></span></p>",

  "M1_H2_TITLE":"Sorry:  it's not possible to immigrate through your children.",

  "M1_H3_TITLE":"Wait until child turns 21.",

  "M1_H4_TITLE":"Have child file N-400 application to become US citizen as soon as possible if he or she is 18 or over and had green card for at least 5 years (3 in some cases).  Then after it's approved, wait (if necessary) until child is 21 or over.",

  "M1_H5_TITLE":"Please choose from the following options:",
  "M1_H5_OPTIONA":"Have parent file I-130 petition for you under the F2A category and wait until it's approved and priority date current; or if such an I-130 already filed, wait until it's approved and priority date current.",
  "M1_H5_OPTIONB":"Have parent file N-400 application when you're still under 21 to become US citizen if he or she had green card for at least 5 years (3 in some cases) and wait until N-400 is approved and parent is citizen.",
  "M1_H5_TITLE_NOTE":"<p><em>Note:&nbsp;</em>F2A category = unmarried children (under 21) and spouses of green-card holders.<br /><br />Which option to choose depends on how soon your parent is eligible to file for citizenship. &nbsp;If parent is eligible right now to file for citizenship (usually after 5 years of having green card), then usually&nbsp;the second option (file for N-400) will be faster as it takes only about 6 months on average for the N-400 to be approved, which allows you to start the green card process immediately afterward. &nbsp;Whereas, it's taking about a year or two for a new I-130 petition filed by your green-card parent to have its priority date current under the F2A category (having a visa available for you to immigrate).&nbsp;<br /><br />However, if it's been a while since an I-130 was already filed for you by your green-card parent (even before running this app) and it's simply waiting for its priority date to be current, it&nbsp;might not be too long until the priority date is current so the first option would be better and should be chosen.<br /><br /><em>Warning:</em>&nbsp;&nbsp;If you are close to 21 years of age, it might not be a good idea for your parent to file for citizenship unless it's reasonably sure that your parent's N-400 application will be approved before you turn 21. &nbsp;The reason is because if your parent becomes a citizen after you've turned 21, you will be automatically switched into the F1 category, which usually is years slower than your F2A category. Another consideration is, if you have children under 21 and unmarried, they can be included in your green-card parent's petition for you under the F2A category and can immigrate with you, whereas if your parent becomes a citizen before you turn 21, your children cannot be included in the petition for you.</p>",

  "M1_H6_TITLE":"Have parent file N-400 application when you're still under 21 to become US citizen.",

  "M1_H7_TITLE":"Have such sibling file I-130 petition for you under the F4 category and wait until it's approved and priority date current; or if I-130 already filed but not current, wait until it's approved and priority date current.",
  "M1_H7_TITLE_BODY":"<p><span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.&nbsp;</span><span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and your sibling here exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span></span></p>",


  "M1_H8_TITLE":"Since you have a job offer from a US employer, have employer file labor certification for you (if necessary and one hasn't been filed yet) and get that certified, then file I-140 petition for you and wait until it's approved and priority date current; or if I-140 already filed but not current, wait until it's approved and priority date current.",
  "M1_H8_TITLE_BODY":"<p><span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.&nbsp;<br /> <br /> But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and the employer here exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span></p>",

  "M1_H9_TITLE":"Compute your 'effective age' as follows:  (1) determine your age on the date when a visa number became or will become available for you under the F2A category  (which is the date in the Visa Bulletin when your petition's priority date became or will become current or the petition's approval date itself, whichever is later), then (2) reduce that age by the number of days the petition was or will be pending.",

  "M1_OV0_TITLE":"File I-539 to extend your status on same visa or to change status to another visa category.",
  "M1_OV0_TITLE_BODY":"This is only a temporary strategy to extend your stay in the US while waiting for the green card process to complete so you can remain permanently.",

  "M1_OV1_TITLE":"Your citizen spouse, child, or parent, depending on who’s being discussed, files an I-130 petition for you (unless one's already been filed) concurrently with you filing I-485 application for green card.",

  "M1_OV2_TITLE":"Have spouse file N-400 application to become US citizen.  Then after it's approved, you file I-485 application for green card.",

  "M1_OV3_TITLE":"Have child file an I-130 petition for you concurrently with you filing I-485 application for green card.",

  "M1_OV4_TITLE":"File I-485 application for green card.  Your unmarried children under 21 (if any), are also eligible to file the I-485 (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",

  "M1_OV5_TITLE":"File I-485 and I-485A applications for green card.  Your unmarried children under 21 (if any), are also eligible to file the I-485 and possibly the I-485A (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",

  "M1_OV6_TITLE":"Since you will be out of status in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card).  If will be out of status for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval before going back to home country. \nYour unmarried children under 21 (if any), are also eligible to go through the same process, and must file the I-601A or I-601 waiver, too, if they were out of status/unlawfully present for more than 180 days in the US.",
  "M1_OV6_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em>not</em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.). &nbsp;Same thing applies to your children.</span></p>",

  "M1_OV7_TITLE":"Since you will be out of status in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card).  If out of status for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval if have citizen/green card parent or spouse, before going back to home country.  If no such parent or spouse, will be subject to 3- or 10-year bar. \nYour spouse (if any) and your unmarried children under 21 (if any) will also be eligible to go through the same process, and must file the I-601A or I-601 waiver, too, if they were out of status/unlawfully present for more than 180 days in the US.",
  "M1_OV7_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em><span>not</span></em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.). &nbsp;Same thing applies to your spouse and children.</span></p>",


  "M1_OV8_TITLE":"File I-485 and I-485A applications for green card.  Your spouse (if any) and your unmarried children under 21 (if any) are also eligible to file the I-485 and possibly the I-485A (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",

  "M1_OV9_TITLE":"File I-485 application for green card.  Your spouse (if any) and your unmarried children under 21 (if any) are also eligible to file the I-485 (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",


  "M3_QUES1_TITLE":"Please choose as many of these that are true about yourself (or None):",

  "M3_OC1_TITLE":"Since you are married, please choose one that is true:",
  "M3_OC1_OPTIONA":"My spouse is a US citizen",
  "M3_OC1_OPTIONB":"My spouse has a green card",
  "M3_OC1_OPTIONC":"My spouse is neither citizen nor has green card",

  "M3_OC2_TITLE":"Since you have children, please choose one that is true:",
  "M3_OC2_OPTIONA":"At least one child is a US citizen 21 or over",
  "M3_OC2_OPTIONB":"At least one child is a citizen but no such child is 21 yet",
  "M3_OC2_OPTIONC":"No child is a citizen but  at least one child has a green card",
  "M3_OC2_OPTIOND":"No child is a citizen nor has green card",
  "M3_OC2_TITLE_NOTE":"<p><em><span>Note</span></em><span>: &nbsp;a \"child\" can also include your stepchild, as long as you were married to his or her parent before the stepchild turned 18.</span></p>",

  "M3_OC3_TITLE":"Since you are under 21 and unmarried, please choose one that is true:",
  "M3_OC3_OPTIONA":"I have a US citizen parent",
  "M3_OC3_OPTIONB":"I have a parent with green card",
  "M3_OC3_OPTIONC":"I have no citizen nor green card parent",
  "M3_OC3_TITLE_NOTE":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" can also include your step-parent, as long as he or she was married to your parent before you turned 18.</span></p>",

  "M3_H1_TITLE":"Please choose from the following options:",
  "M3_H1_OPTIONA":"Have spouse file I-130 petition for you and wait until it's approved and priority date current; or if such an I-130 already filed, wait until it's approved and priority date current.",
  "M3_H1_OPTIONB":"Have spouse file N-400 application to become US citizen if he or she had green card for at least 5 years and wait until N-400 is approved and spouse is citizen.",
  "M3_H1_TITLE_NOTE":"<p><em><span>Note: &nbsp;</span></em><span>your spouse must be at least 18 to be able to petition for you.<em><br /> <br /> </em></span><span>Which option to choose depends on how soon your spouse is eligible to file for citizenship. &nbsp;If spouse is eligible right now to file for citizenship (usually after 5 years of having green card), then usually&nbsp;the second option (file for N-400) will be faster as it takes only about 6 months on average for the N-400 to be approved, which allows you to start the green card process immediately afterward. &nbsp;Whereas, it's taking about a year or two for a new I-130 petition filed by your green-card spouse to have its priority date current (having a visa available for you to immigrate).&nbsp;</span></p><p><span>However, if it's been a while since an I-130 was already filed for you by your green-card spouse (even before running this app) and it's simply waiting for its priority date to be current, it&nbsp;might not be too long until the priority date is current so the first option would be better and should be chosen.</span><span><br /> <br /> <span>Also, if you have children under 21 and unmarried who are also your spouse's children or his or her stepchildren who were under 18 when you married your spouse,&nbsp;they can be included in your spouse's petition for you, whereas if your spouse is a citizen, he or she has to file separate petitions for you and for each of your children (and sometimes the spouse is not willing to do that).</span></span></p>",

  "M3_H2_TITLE":"Sorry:  it's not possible to immigrate through your children.",

  "M3_H3_TITLE":"Wait until child turns 21.",

  "M3_H4_TITLE":"Have child file N-400 application to become US citizen as soon as possible if he or she is 18 or over and had green card for at least 5 years (3 in some cases).  Then after it's approved, wait (if necessary) until child is 21 or over.",

  "M3_H5_TITLE":"Please choose from the following options:",
  "M3_H5_OPTIONA":"Have parent file I-130 petition for you under the F2A category and wait until it's approved and priority date current; or if such an I-130 already filed, wait until it's approved and priority date current.",
  "M3_H5_OPTIONB":"Have parent file N-400 application when you're still under 21 to become US citizen if he or she had green card for at least 5 years (3 in some cases) and wait until N-400 is approved and parent is citizen.",
  "M3_H5_TITLE_NOTE":"<p><em>Note:&nbsp;</em>F2A category = unmarried children (under 21) and spouses of green-card holders.<br /><br />Which option to choose depends on how soon your parent is eligible to file for citizenship. &nbsp;If parent is eligible right now to file for citizenship (usually after 5 years of having green card), then usually&nbsp;the second option (file for N-400) will be faster as it takes only about 6 months on average for the N-400 to be approved, which allows you to start the green card process immediately afterward. &nbsp;Whereas, it's taking about a year or two for a new I-130 petition filed by your green-card parent to have its priority date current under the F2A category (having a visa available for you to immigrate).&nbsp;<br /><br />However, if it's been a while since an I-130 was already filed for you by your green-card parent (even before running this app) and it's simply waiting for its priority date to be current, it&nbsp;might not be too long until the priority date is current so the first option would be better and should be chosen.<br /><br /><em>Warning:</em>&nbsp;&nbsp;If you are close to 21 years of age, it might not be a good idea for your parent to file for citizenship unless it's reasonably sure that your parent's N-400 application will be approved before you turn 21. &nbsp;The reason is because if your parent becomes a citizen after you've turned 21, you will be automatically switched into the F1 category, which usually is years slower than your F2A category. Another consideration is, if you have children under 21 and unmarried, they can be included in your green-card parent's petition for you under the F2A category and can immigrate with you, whereas if your parent becomes a citizen before you turn 21, your children cannot be included in the petition for you.</p>",

  "M3_H6_TITLE":"Compute your 'effective age' as follows:  (1) determine your age on the date when a visa number became or will become available for you under the F2A category  (which is the date in the Visa Bulletin when your petition's priority date became or will become current or the petition's approval date itself, whichever is later), then (2) reduce that age by the number of days the petition was or will be pending.",

  "M3_H7_TITLE":"Have such sibling file I-130 petition for you under the F4 category and wait until it's approved and priority date current; or if I-130 already filed but not current, wait until it's approved and priority date current.",
  "M3_H7_TITLE_BODY":"<p><span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.&nbsp;</span><span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and your sibling here exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span></span></p>",

  "M3_H8_TITLE":"Since you have a job offer from a US employer, have employer file labor certification for you (if necessary and one hasn't been filed yet) and get that certified, then file I-140 petition for you and wait until it's approved and priority date current; or if I-140 already filed but not current, wait until it's approved and priority date current.",
  "M3_H8_TITLE_BODY":"<p><span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.&nbsp;<br /> <br /> But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and the employer here exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span></p>",

  "M3_D1_TITLE":"Will parent have completed the citizenship process and become citizen before you turned 21?",
  "M3_D1_TITLE_BODY":"If your parent becomes a citizen before you turn 21, you will be considered an immediate relative and so if there's already an I-130 petition filed for you, it would immediately have its priority date current.  If parent becomes citizen after you turn 21, you will be considered in the F1 category (unmarried son/daughter 21 or over of citizen) and must wait until the I-130's priority date is current.",

  "M3_D2_TITLE":"Once I-130 is approved and has priority date current under option A above, will you still be under 21 by that time?",

  "M3_D3_TITLE":"Is your effective age just computed under 21?",

  "M3_D4_TITLE":"Do you have any US citizen sibling 21 or over?",

  "M3_D5_TITLE":"Are you interested in the remaining methods, if any, to obtain a green card (even if you've arrived at this step after having been recommended a method to obtain an immigrant visa)?",
  "M3_D5_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;these other methods may be slower or faster than the method(s) that have been recommended for you so far. &nbsp;It's important to see what your options are, however.</span></p>",

  "M3_D6_TITLE":"Are you interested in other methods (not green card or necessarily permanent), if any, to remain in the US?",
  "M3_D6_TITLE_BODY":"Methods that may not necessarily result in permanent stay in US.",

  "M3_OV1_TITLE":"Your citizen spouse, child, or parent, depending on who’s being discussed, files I-130 petition for you (unless one has already been filed) and wait for approval.  Then, you go through consular processing and interview in your home country to receive immigrant visa (green card).",

  "M3_OV2_TITLE":"Once I-130 is approved and has priority date current under option A above, you go through consular processing and interview in your home country to receive immigrant visa (green card).  Your unmarried children under 21 (if any), are also eligible to receive immigrant visas but only as your dependents.",

  "M3_OV3_TITLE":"Have child file an I-130 petition for you and wait for approval.  Then you go through consular processing and interview in your home country to receive immigrant visa (green card).",

  "M3_OV4_TITLE":"Then, you'll go through consular processing and interview in your home country to receive immigrant visa (green card).  Your spouse (if any) and your unmarried children under 21 (if any) will also be eligible to receive immigrant visas but only as your dependents.",


  "AP_D1_TITLE": "Did you suffer from or do you fear persecution in your home country on basis of race, religion, nationality, political opinion, or being member of a social group?",
  "AP_D1_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a generalized fear of crimes or criminality in your home country is normally not enough to establish the right type of 'persecution' under US law.</span></p>",

  "AP_D2_TITLE": "Has it been less than 1 year since you entered the US?",

  "AP_D3_TITLE": "Are you the spouse, parent, or child under 21 of a US active-duty military service member?",

  "AP_R1_TITLE": "Do you meet all the following conditions: \n1. Came to the US before the age of 16, \n2. Were under the age of 31 as of June 15, 2012, \n3. Have continuously resided in the US since June 15, 2007, \n4. Were present in US on June 15, 2012 and in US now, \n5. Had no lawful immigration status on June 15, 2012, \n6. Currently in school, graduated from high school, obtained GED, or received a military honorable discharge, and \n7. Have not been convicted of a felony, a significant misdemeanor, or 3 misdemeanors?",

  "AP_OV1_TITLE": "File I-589 application for withholding of removal.",

  "AP_OV2_TITLE": "File I-589 application for political asylum.",

  "AP_OV3_TITLE": "File I-821D for Deferred Action for Childhood Arrivals (DACA) benefits",

  "AP_OV4_TITLE": "File I-131 application for parole-in-place benefit",

  "RP_D1_TITLE": "Did you suffer from or do you fear persecution in your home country on basis of race, religion, nationality, political opinion, or being member of a social group?",
  "RP_D1_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a generalized fear of crimes or criminality in your home country is normally not enough to establish the right type of 'persecution' under US law.</span></p>",

  "RP_OV1_TITLE": "Apply for refugee status to the US from your home country",

  "P41_D1_TITLE": "Has spouse been petitioned for in the past for green card or immigrant status by a US citizen/green card parent, citizen sibling or US employer?",
  "P41_D1_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.</span></p>",

  "P41_D2_TITLE": "Wait until the petition filed for spouse is approved and has priority date current under the appropriate category (unless it's already approved and has priority date current).  Then, will you have maintained status in the US by that time?",
  "P41_D2_TITLE_BODY":"<p><span>F3 = married sons/daughters of citizens</span><span><br /> <span>F4 = siblings of 21 or over citizens</span><br /> <br /> <span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your spouse's petition's priority date, the sooner there will be a visa number available for him or her. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.</span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between your spouse and petitioner (his or her parent or sibling or employer here) exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.<em><br /> <br /> <span>Note:</span></em>&nbsp; It may take many years for the priority date to be current in these categories, so you should plan ahead and strive to take steps to maintain legal status in the US on your existing nonimmigrant visa or change to another type of visa. &nbsp;If you go out of status, you may have to return to your home country to obtain green card and risk the 10-year bar.</span></span></p>",

  "P41_D3_TITLE": "Would spouse's parent apply for citizenship if qualified to do so at this time (had green card for at least 5 years, or 3 in some cases) or in the future?",
  "P41_D3_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;because spouse is now married to you, spouse's parent having citizenship rather than just green card will prevent the petition filed for spouse from being invalidated. &nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history.</span></p>",

  "P41_D4_TITLE": "Is that spouse's parent now a US citizen?",
  "P41_D4_TITLE_BODY":"<p><em><span>Note:</span></em><span>&nbsp;&nbsp;If the petition filed for your spouse by his or her parent was in the F2A or F2B category (<em><span>unmarried</span></em>&nbsp;minors or older children of green-card holders), it may now be invalid because spouse is married, and the early priority date of that petition cannot be taken advantage of. &nbsp;A new petition with a new priority date would have to be filed for your spouse, unless the parent already is or can become a citizen and the petition was in F2A category,&nbsp;in which case the old petition would still be valid and converted to the F3 category with the old priority date preserved.</span></p>",

  "P41_D5_TITLE": "Does spouse have any US citizen parent, citizen sibling 21 or over, or US employer willing to file an I-130 or I-140 petition for him or her?",
  "P41_D5_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.</span><span><br /> <br /> <span>If&nbsp;your spouse's parent has a green card, he or she cannot petition for your spouse since there is no category for green-card holders to petition for their married children.</span><br /> <br /> <span>It's very well possible that your spouse may have a parent, sibling or employer, where any of them (or all) could petition for your spouse, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your spouse rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your spouse is a Mexican citizen, a petition by your spouse's sibling for him or her is moving faster than one by his or her parent by a few years.</span></span></p>",

  "P41_D6_TITLE": "Did spouse get married before his or her parent became citizen?",
  "P41_D6_TITLE_BODY":"<p><span>If the petition filed for your spouse by his or her parent was in the F2B category (unmarried son/daughter 21 or over of green-card holder), unfortunately it would be invalid if spouse got married after the filing but&nbsp;<em><span>before</span></em>&nbsp;his or her parent became a citizen.</span></p>",

  "P41_OC1_TITLE": "Was petition filed for spouse in the following way (choose one)?",
  "P41_OC1_OPTIONA": "By spouse's parent who had green card and spouse was under 21 and unmarried at the time (petition under F2A category)",
  "P41_OC1_OPTIONB": "By spouse's parent who had green card and spouse was 21 or over and unmarried at the time (petition under F2B category)",
  "P41_OC1_OPTIONC": "By spouse's parent who was a citizen and spouse was 21 or over and unmarried at the time (petition under F1 category)",
  "P41_OC1_OPTIOND": "By spouse's parent who was a citizen and spouse was already married (petition under F3 category) or By sibling who was a citizen 21 or over at the time (petition under F4 category) or By US employer",

  "P41_H1_TITLE": "Unfortunately, the petition filed by spouse's parent for spouse in the F2A category has been invalidated because spouse is now married and his or her parent is unwilling or unable to file for citizenship.  A new I-130 petition with a new priority date would have to be filed for spouse by a new relative. \nIf spouse's other parent is a citizen he or she should file a new petition for spouse in the F3 category (married sons/daughters of citizens). \nIf your spouse has a citizen sibling 21 or over, he or she can file a new petition for spouse in the F4 category. \nIf your spouse has a US employer willing to sponsor him or her, it can file a labor certification for spouse (if one is necessary), then an I-140 petition for him or her in an employment category.",
  "P41_H1_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.</span><span><br /> <br /> <span>It's very well possible that your spouse may have a parent, sibling or employer, where any of them (or all) could petition for your spouse, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your spouse rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your spouse is a Mexican citizen, a petition by your spouse's sibling for him or her is moving faster than one by his or her parent by a few years.</span></span></p>",

  "P41_H2_TITLE": "Unfortunately, the petition filed by your spouse's parent for spouse in the F2B category has been invalidated because your spouse married before his or her parent became a citizen.  A new I-130 petition with a new priority date would have to be filed for spouse. \nIf that same parent has had a green card for at least 5 years (or 3 in some cases), he or she should file an N-400 application to become a citizen then afterward file a new petition for your spouse under the F3 category (married sons/daughters of citizens).  If that same parent is already a citizen, he or she should file a new petition for spouse under F3.  If spouse's other parent is a citizen he or she can also file a new petition for spouse under F3. \nIf your spouse has a citizen sibling 21 or over, he or she can file a new petition for spouse in the F4 category. \nIf your spouse has a US employer willing to sponsor him or her, it can file a labor certification for spouse (if one is necessary), then an I-140 petition for him or her in an employment category.",
  "P41_H2_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.<br /> <br /> It's very well possible that your spouse may have a parent, sibling or employer, where any of them (or all) could petition for your spouse, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your spouse rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your spouse is a Mexican citizen, a petition by your spouse's sibling for him or her is moving faster than one by his or her parent by a few years.</span></p>",

  "P41_H3_TITLE": "Have spouse's parent file N-400 application to become US citizen and wait until approval.",

  "P41_H4_TITLE": "The petition filed by spouse's parent for spouse is now converted to the F3 category (married sons/daughters of citizens).",

  "P41_H5_TITLE": "Sorry:  it's not possible to immigrate through your spouse. \nPlease press Ok to explore the remaining methods, if any, to obtain a green card.",

  "P41_H6_TITLE": "Have your spouse's parent or sibling file I-130 petition for him or her, OR \nHave US employer file labor certification for your spouse (if necessary and one hasn't been filed yet) and get that certified, then an I-140 petition for him or her.",

  "P41_OV1_TITLE": "File I-485 application for green card as a dependent only together with spouse's I-485.  Your unmarried children under 21 (if any), are also eligible to file the I-485 (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",

  "P41_OV2_TITLE": "File I-485 and I-485A applications for green card as a dependent only together with spouse's I-485.  Your unmarried children under 21 (if any), are also eligible to file the I-485 and possibly the I-485A (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",

  "P41_OV3_TITLE": "Since you will be out of status in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card) either concurrently with spouse's application or shortly after, and only as a dependent of spouse.  If out of status for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval if have citizen/green card parent or green card spouse (who got green card approved before you), before going back to home country.  If no such parent or spouse, will be subject to 3- or 10-year bar. \nYour unmarried children under 21 (if any), will also be eligible to go through the same process, and must file the I-601A or I-601 waiver, too, if they were out of status/unlawfully present for more than 180 days in the US.",
  "P41_OV3_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em><span>not</span></em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.). &nbsp;Same thing applies to your children.</span></p>",

  "P42_D1_TITLE": "Has spouse been petitioned for in the past for green card or immigrant status by a US citizen/green card parent, citizen sibling or US employer?",
  "P42_D1_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.</span></p>",

  "P42_D3_TITLE": "Would spouse's parent apply for citizenship if qualified to do so at this time (had green card for at least 5 years, or 3 in some cases) or in the future?",
  "P42_D3_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;because spouse is now married to you, spouse's parent having citizenship rather than just green card will prevent the petition filed for spouse from being invalidated. &nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history.</span></p>",

  "P42_D4_TITLE": "Is that spouse's parent now a US citizen?",
  "P42_D4_TITLE_BODY":"<p><em><span>Note:</span></em><span>&nbsp;&nbsp;If the petition filed for your spouse by his or her parent was in the F2A or F2B category (<em><span>unmarried</span></em>&nbsp;minors or older children of green-card holders), it may now be invalid because spouse is married, and the early priority date of that petition cannot be taken advantage of. &nbsp;A new petition with a new priority date would have to be filed for your spouse, unless the parent already is or can become a citizen and the petition was in F2A category,&nbsp;in which case the old petition would still be valid and converted to the F3 category with the old priority date preserved.</span></p>",

  "P42_D5_TITLE": "Does spouse have any US citizen parent, citizen sibling 21 or over, or US employer willing to file an I-130 or I-140 petition for him or her?",
  "P42_D5_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.</span><span><br /> <br /> <span>If&nbsp;your spouse's parent has a green card, he or she cannot petition for your spouse since there is no category for green-card holders to petition for their married children.</span><br /> <br /> <span>It's very well possible that your spouse may have a parent, sibling or employer, where any of them (or all) could petition for your spouse, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your spouse rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your spouse is a Mexican citizen, a petition by your spouse's sibling for him or her is moving faster than one by his or her parent by a few years.</span></span></p>",

  "P42_D6_TITLE": "Did spouse get married before his or her parent became citizen?",
  "P42_D6_TITLE_BODY":"If the petition filed for your spouse by his or her parent was in the F2B category (unmarried son/daughter 21 or over of green-card holder), unfortunately it would be invalid if spouse got married after the filing but before his or her parent became a citizen.",

  "P42_OC1_TITLE": "Was petition filed for spouse in the following way (choose one)?",
  "P42_OC1_OPTIONA":"By spouse's parent who had green card and spouse was under 21 and unmarried at the time (petition under F2A category)",
  "P42_OC1_OPTIONB":"By spouse's parent who had green card and spouse was 21 or over and unmarried at the time (petition under F2B category)",
  "P42_OC1_OPTIONC":"By spouse's parent who was a citizen and spouse was 21 or over and unmarried at the time (petition under F1 category)",
  "P42_OC1_OPTIOND":"By spouse's parent who was a citizen and spouse was already married (petition under F3 category) or By sibling who was a citizen 21 or over at the time (petition under F4 category) or By US employer",

  "P42_H1_TITLE": "Unfortunately, the petition filed by spouse's parent for spouse in the F2A category has been invalidated because spouse is now married and his or her parent is unwilling or unable to file for citizenship.  A new I-130 petition with a new priority date would have to be filed for spouse by a new relative. \nIf spouse's other parent is a citizen he or she should file a new petition for spouse in the F3 category (married sons/daughters of citizens). \nIf your spouse has a citizen sibling 21 or over, he or she can file a new petition for spouse in the F4 category. \nIf your spouse has a US employer willing to sponsor him or her, it can file a labor certification for spouse (if one is necessary), then an I-140 petition for him or her in an employment category.",
  "P42_H1_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.</span><span><br /> <br /> <span>It's very well possible that your spouse may have a parent, sibling or employer, where any of them (or all) could petition for your spouse, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your spouse rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your spouse is a Mexican citizen, a petition by your spouse's sibling for him or her is moving faster than one by his or her parent by a few years.</span></span></p>",

  "P42_H2_TITLE": "Unfortunately, the petition filed by your spouse's parent for spouse in the F2B category has been invalidated because your spouse married before his or her parent became a citizen.  A new I-130 petition with a new priority date would have to be filed for spouse. \nIf that same parent has had a green card for at least 5 years (or 3 in some cases), he or she should file an N-400 application to become a citizen then afterward file a new petition for your spouse under the F3 category (married sons/daughters of citizens).  If that same parent is already a citizen, he or she should file a new petition for spouse under F3.  If spouse's other parent is a citizen he or she can also file a new petition for spouse under F3. \nIf your spouse has a citizen sibling 21 or over, he or she can file a new petition for spouse in the F4 category. \nIf your spouse has a US employer willing to sponsor him or her, it can file a labor certification for spouse (if one is necessary), then an I-140 petition for him or her in an employment category.",
  "P42_H2_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.<br /> <br /> It's very well possible that your spouse may have a parent, sibling or employer, where any of them (or all) could petition for your spouse, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your spouse rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your spouse is a Mexican citizen, a petition by your spouse's sibling for him or her is moving faster than one by his or her parent by a few years.</span></p>",

  "P42_H3_TITLE": "Have spouse's parent file N-400 application to become US citizen and wait until approval.",

  "P42_H4_TITLE": "The petition filed by spouse's parent for spouse is now converted to the F3 category (married sons/daughters of citizens).",

  "P42_H5_TITLE": "Sorry:  it's not possible to immigrate through your spouse. \nPlease press Ok to explore the remaining methods, if any, to obtain a green card.",

  "P42_H6_TITLE": "Have your spouse's parent or sibling file I-130 petition for him or her, OR \n Have US employer file labor certification for your spouse (if necessary and one hasn't been filed yet) and get that certified, then an I-140 petition for him or her.",

  "P42_H7_TITLE": "Wait until the petition filed for spouse is approved and has priority date current under the appropriate category (unless it's already approved and has priority date current).",
  "P42_H7_TITLE_BODY":"<p><span>F3 = married sons/daughters of citizens</span><span><br /> <span>F4 = siblings of 21 or over citizens</span><br /> <br /> <span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your spouse's petition's priority date, the sooner there will be a visa number available for him or her. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.</span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between your spouse and petitioner (his or her parent or sibling or employer here) exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.<em><br /> <br /> </em></span></span></p>",

  "P42_OV1_TITLE": "File I-485 and I-485A applications for green card as a dependent only together with spouse's I-485.  Your unmarried children under 21 (if any), are also eligible to file the I-485 and possibly the I-485A (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",

  "P42_OV2_TITLE": "Since you are out of status/unlawfully present in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card) either concurrently with spouse's application or shortly after, and only as a dependent of spouse.  If out of status for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval if have citizen/green card parent or green card spouse (who got green card approved before you), before going back to home country.  If no such parent or spouse, will be subject to 3- or 10-year bar. \nYour unmarried children under 21 (if any), will also be eligible to go through the same process, and must file the I-601A or I-601 waiver, too, if they were out of status/unlawfully present for more than 180 days in the US.",
  "P42_OV2_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em><span>not</span></em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.). &nbsp;Same thing applies to your children.</span></p>",

  "P43_D1_TITLE": "Has spouse been petitioned for in the past for green card or immigrant status by a US citizen/green card parent, citizen sibling or US employer?",
  "P43_D1_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.</span></p>",

  "P43_D3_TITLE": "Would spouse's parent apply for citizenship if qualified to do so at this time (had green card for at least 5 years, or 3 in some cases) or in the future?",
  "P43_D3_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;because spouse is now married to you, spouse's parent having citizenship rather than just green card will prevent the petition filed for spouse from being invalidated. &nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history.</span></p>",

  "P43_D4_TITLE": "Is that spouse's parent now a US citizen?",
  "P43_D4_TITLE_BODY":"<p><em><span>Note:</span></em><span>&nbsp;&nbsp;If the petition filed for your spouse by his or her parent was in the F2A or F2B category (<em><span>unmarried</span></em>&nbsp;minors or older children of green-card holders), it may now be invalid because spouse is married, and the early priority date of that petition cannot be taken advantage of. &nbsp;A new petition with a new priority date would have to be filed for your spouse, unless the parent already is or can become a citizen and the petition was in F2A category,&nbsp;in which case the old petition would still be valid and converted to the F3 category with the old priority date preserved.</span></p>",

  "P43_D5_TITLE": "Does spouse have any US citizen parent, citizen sibling 21 or over, or US employer willing to file an I-130 or I-140 petition for him or her?",
  "P43_D5_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.</span><span><br /> <br /> <span>If&nbsp;your spouse's parent has a green card, he or she cannot petition for your spouse since there is no category for green-card holders to petition for their married children.</span><br /> <br /> <span>It's very well possible that your spouse may have a parent, sibling or employer, where any of them (or all) could petition for your spouse, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your spouse rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your spouse is a Mexican citizen, a petition by your spouse's sibling for him or her is moving faster than one by his or her parent by a few years.</span></span></p>",

  "P43_D6_TITLE": "Did spouse get married before his or her parent became citizen?",
  "P43_D6_TITLE_BODY":"<p><span>If the petition filed for your spouse by his or her parent was in the F2B category (unmarried son/daughter 21 or over of green-card holder), unfortunately it would be invalid if spouse got married after the filing but&nbsp;<em><span>before</span></em>&nbsp;his or her parent became a citizen.</span></p>",

  "P43_OC1_TITLE": "Was petition filed for spouse in the following way (choose one)?",
  "P43_OC1_OPTIONA":"By spouse's parent who had green card and spouse was under 21 and unmarried at the time (petition under F2A category)",
  "P43_OC1_OPTIONB":"By spouse's parent who had green card and spouse was 21 or over and unmarried at the time (petition under F2B category)",
  "P43_OC1_OPTIONC":"By spouse's parent who was a citizen and spouse was 21 or over and unmarried at the time (petition under F1 category)",
  "P43_OC1_OPTIOND":"By spouse's parent who was a citizen and spouse was already married (petition under F3 category) or By sibling who was a citizen 21 or over at the time (petition under F4 category) or By US employer",

  "P43_H1_TITLE": "Unfortunately, the petition filed by spouse's parent for spouse in the F2A category has been invalidated because spouse is now married and his or her parent is unwilling or unable to file for citizenship.  A new I-130 petition with a new priority date would have to be filed for spouse by a new relative. \nIf spouse's other parent is a citizen he or she should file a new petition for spouse in the F3 category (married sons/daughters of citizens). \nIf your spouse has a citizen sibling 21 or over, he or she can file a new petition for spouse in the F4 category. \nIf your spouse has a US employer willing to sponsor him or her, it can file a labor certification for spouse (if one is necessary), then an I-140 petition for him or her in an employment category.",
  "P43_H1_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.</span><span><br /> <br /> <span>It's very well possible that your spouse may have a parent, sibling or employer, where any of them (or all) could petition for your spouse, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your spouse rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your spouse is a Mexican citizen, a petition by your spouse's sibling for him or her is moving faster than one by his or her parent by a few years.</span></span></p>",

  "P43_H2_TITLE": "Unfortunately, the petition filed by your spouse's parent for spouse in the F2B category has been invalidated because your spouse married before his or her parent became a citizen.  A new I-130 petition with a new priority date would have to be filed for spouse. \nIf that same parent has had a green card for at least 5 years (or 3 in some cases), he or she should file an N-400 application to become a citizen then afterward file a new petition for your spouse under the F3 category (married sons/daughters of citizens).  If that same parent is already a citizen, he or she should file a new petition for spouse under F3.  If spouse's other parent is a citizen he or she can also file a new petition for spouse under F3. \nIf your spouse has a citizen sibling 21 or over, he or she can file a new petition for spouse in the F4 category. \nIf your spouse has a US employer willing to sponsor him or her, it can file a labor certification for spouse (if one is necessary), then an I-140 petition for him or her in an employment category.",
  "P43_H2_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.<br /> <br /> It's very well possible that your spouse may have a parent, sibling or employer, where any of them (or all) could petition for your spouse, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your spouse rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your spouse is a Mexican citizen, a petition by your spouse's sibling for him or her is moving faster than one by his or her parent by a few years.</span></p>",

  "P43_H3_TITLE": "Have spouse's parent file N-400 application to become US citizen and wait until approval.",

  "P43_H4_TITLE": "The petition filed by spouse's parent for spouse is now converted to the F3 category (married sons/daughters of citizens).",

  "P43_H5_TITLE": "Sorry:  it's not possible to immigrate through your spouse. \nPlease press Ok to explore the remaining methods, if any, to obtain a green card.",

  "P43_H6_TITLE": "Have your spouse's parent or sibling file I-130 petition for him or her, OR \nHave US employer file labor certification for your spouse (if necessary and one hasn't been filed yet) and get that certified, then an I-140 petition for him or her.",

  "P43_H7_TITLE": "Wait until the petition filed for spouse is approved and has priority date current under the appropriate category (unless it's already approved and has priority date current).",
  "P43_H7_TITLE_BODY":"<p><span>F3 = married sons/daughters of citizens</span><span><br /> <span>F4 = siblings of 21 or over citizens</span><br /> <br /> <span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your spouse's petition's priority date, the sooner there will be a visa number available for him or her. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.</span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between your spouse and petitioner (his or her parent or sibling or employer here) exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span></span></p>",

  "P43_OV1_TITLE": "Then, you'll go through consular processing and interview in your home country to receive immigrant visa (green card) only as a dependent together with spouse's immigrant visa application.  Your unmarried children under 21 (if any), will also be eligible to receive immigrant visas but only as dependents of your spouse.",

  "P51_D1_TITLE": "Have you been petitioned for in the past for green card or immigrant status by your US citizen/green card parent or citizen sibling, with filing of an I-130 petition?",
  "P51_D1_TITLE_BODY": "<p><em><span>Note: &nbsp;</span></em><span>the term&nbsp;\"parent\" can also include your step-parent, as long as he or she was married to your natural parent before you turned 18.</span></p>",

  "P51_D2_TITLE": "Is that parent now a US citizen?",

  "P51_D3_TITLE": "Did that parent become citizen when you were still under 21?",

  "P51_D4_TITLE": "Did you marry before your parent became citizen?",
  "P51_D4_TITLE_BODY": "If the petition filed for you by your parent was in the F2B category (unmarried son/daughter 21 and over of green-card holder), unfortunately it would be invalid if you got married before your parent became a citizen.",

  "P51_D5_TITLE": "Would your parent apply for citizenship if qualified to do so at this time (had green card for at least 5 years, or 3 in some cases) or in the future?",
  "P51_D5_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;because you are now married, your parent having citizenship rather than just green card will prevent the petition filed for you from being invalidated.&nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history.</span></p>",

  "P51_D6_TITLE": "Then, will you have maintained status in US by that time?",

  "P51_D7_TITLE": "Do you have any US citizen/green card parent willing to file an I-130 petition for you?",
  "P51_D7_TITLE_BODY": "<p><em><span>Note: &nbsp;</span></em><span>a&nbsp;\"parent\" can also include your step-parent, as long as he or she was married to your natural parent before you turned 18.</span><span><br /> <br /> <span>If your parent only has a green card and you are married, he or she cannot file a petition for you. &nbsp;If that is the case, please select 'No'. &nbsp;</span></span></p>",

  "P51_D8_TITLE": "Are you from Mexico?",
  "P51_D8_TITLE_BODY": "If you are from Mexico, you could benefit from having a check on whether you have a US citizen sibling who could petition for you in the next step, since for Mexicans the F4 category of siblings is moving a few years faster than the one where you are petitioned for by your parent.",

  "P51_D9_TITLE": "Do you have any US citizen sibling 21 or over willing to file an I-130 petition for you?",

  "P51_D10_TITLE": "Is your effective age just computed under 21?",

  "P51_D11_TITLE": "Then, will you have maintained status in US by that time?",

  "P51_D12_TITLE": "Then, will you have maintained status in US by that time?",

  "P51_D13_TITLE": "Even though we've just gone through the possible direct petitioning by your parent or sibling for you for green card, it's suggested that you continue and see whether a parent was themselves previously petitioned for by their own parent, sibling or employer, because you might be able to benefit indirectly as a derivative and receive green card faster (if petition for parent was filed long enough ago).  If so, please answer Yes.",
  "P51_D13_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;these other methods may be slower or faster than the method(s) that have been recommended for you so far. &nbsp;It's important to see what your possible options are, however.</span></p>",

  "P51_D14_TITLE": "Are you from Mexico?",
  "P51_D14_TITLE_BODY": "If you are from Mexico, you could benefit from having a check on whether you have a US citizen sibling in the next step, since for Mexicans the F4 category of siblings is moving a few years faster than the one where you are petitioned for by your parent.",

  "P51_OC1_TITLE": "Was petition filed for you in the following way (choose one)?",
  "P51_OC1_OPTIONA":"By parent who had green card and you were under 21 and unmarried at the time (petition under F2A category)",
  "P51_OC1_OPTIONB":"By parent who had green card and you were 21 or over and unmarried at the time (petition under F2B category)",
  "P51_OC1_OPTIONC":"By parent who was a citizen and you were 21 or over and unmarried at the time (petition under F1 category)",
  "P51_OC1_OPTIOND":"By parent who was a citizen and you were married at the time (petition under F3 category)",
  "P51_OC1_OPTIONE":"By sibling who was a citizen 21 or over at the time (petition under F4 category)",

  "P51_H1_TITLE": "Unfortunately, the petition filed by your parent for you in the F2B category has been invalidated because you married before your parent became a citizen.  A new I-130 petition with a new priority date would have to be filed for you. \nIf that same parent has had a green card for at least 5 yrs (3 in some cases), he or she should file an N-400 application to become a citizen then afterward file a new petition for you under the F3 category (married sons/daughters of citizens).  If that same parent is already a citizen, he or she should file a new petition for you under F3.  If your other parent is a citizen he or she can also file a new petition for you under F3. \nIf you have a citizen sibling 21 or over, he or she can file a new petition for you in the F4 category.",
  "P51_H1_TITLE_BODY": "<p><em><span>Note: &nbsp;</span></em><span>a&nbsp;\"parent\" can also include your step-parent, as long as he or she was married to your natural parent before you turned 18.</span><span><br /> <br /> <span>It's very well possible that you may have both a parent and a sibling where either or both could petition for you as in the next steps, and usually you'll go with the person whose category will move faster. &nbsp;Almost always that will be your parent petitioning for you rather than your sibling although you must check the Visa Bulletin to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if you're a Mexican citizen, a petition by your sibling for you is moving faster than one by your parent by a few years.</span></span></p>",

  "P51_H2_TITLE": "Unfortunately, the petition filed by your parent for you in the F2A category has been invalidated because you're now married and your parent is unwilling or unable to file for citizenship.  A new I-130 petition with a new priority date would have to be filed for you by a new relative. \nIf your other parent is a citizen he or she should file a new petition for you in the F3 category (married sons/daughters of citizens). \nIf you have a citizen sibling 21 or over, he or she can file a new petition for you in the F4 category.",
  "P51_H2_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.<br /> <br /> It's very well possible that your spouse may have a parent, sibling or employer, where any of them (or all) could petition for your spouse, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your spouse rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your spouse is a Mexican citizen, a petition by your spouse's sibling for him or her is moving faster than one by his or her parent by a few years.</span></p>",


  "P51_H3_TITLE": "Have parent file N-400 application to become US citizen and wait until approval.",

  "P51_H4_TITLE": "Have such parent file I-130 petition for you.",

  "P51_H5_TITLE": "The petition filed by parent for you has been converted to the F3 category (married sons/daughters of citizens).",

  "P51_H6_TITLE": "Have such sibling file I-130 petition for you.",
  "P51_H6_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;If you're from Mexico and there's such a sibling, we're assuming he or she is willing to petition for you. &nbsp;If not, and you have a parent who's willing to petition for you instead, you can restart the app and answer the question as if you have no such sibling.</span></p>",

  "P51_H7_TITLE": "Wait until the petition filed for you is approved and has priority date current under the appropriate category (unless it's already approved and has priority date current).",
  "P51_H7_TITLE_BODY": "<p><span>F1 category = unmarried sons/daughters (21 or over) of citizens</span><span><br /> <span>F2A = spouses and unmarried children (under 21) of green-card holders</span><br /> <span>F2B = unmarried sons/daughters (21 or over) of green-card holders</span><br /> <span>F3 = married sons/daughters of citizens</span><br /> <span>F4 = siblings of 21 or over citizens</span><br /> <br /> <span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card. &nbsp;&nbsp;</span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and petitioner (your parent or sibling here) exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span><br /> <em><span><br /> <span>Note:&nbsp;</span>&nbsp;</span></em><span>It may take many years for the priority date to be current in these categories, so you should plan ahead and strive to take steps to maintain legal status in the US on your existing nonimmigrant visa or change to another type of visa. &nbsp;If you go out of status, you may have to return to your home country to obtain green card and risk the 10-year bar.</span><br /> <em><span><br /> <span>Tip</span></span></em><span>: &nbsp;If the I-130 was filed for you by your parent under F2B category, and while waiting for your priority date to be current, have parent file to become citizen if priority dates move faster under F1 category. &nbsp;If parent files for citizenship anyway, you will be automatically converted from F2B to F1, but you have the right to 'opt out' and stay in F2B if priority dates are moving faster with F2B.</span></span></p>",

  "P51_H8_TITLE": "The petition filed by parent for you has been converted to the F1 category (unmarried sons/daughters 21 or over of citizens).",

  "P51_H9_TITLE": "Because you are now over 21 but trying to benefit from a petition for a child under 21 (F2A), you may have 'aged-out' unless your 'effective age' is under 21.  Compute your effective age as follows:  (1) determine your age on the date when a visa number became or will become available for you under the F2A category (which is the date in the Visa Bulletin when your petition's priority date became or will become current or the petition's approval date itself, whichever is later), then (2) reduce that age by the number of days the petition was or will be pending.",

  "P51_H10_TITLE": "If your effective age will be 21 or over, your parent, who is or will still be a green-card holder, should file a new petition for you in the F2B category (unmarried sons/daughters 21 or over of green-card holders), which is a much slower category.  However, that petition will get the same priority date as the previous petition filed under F2A category for you. \nWait until the new petition is approved and has priority date current under F2B.",
  "P51_H10_TITLE_BODY":"<p><span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card. &nbsp;&nbsp;</span><span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and your parent here) exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span><br /> <em><span><br /> <span>Note:</span></span></em><span>&nbsp; It may take many years for the priority date to be current under this F2B category, so you should plan ahead and strive to take steps to maintain legal status in the US on your existing nonimmigrant visa or change to another type of visa. &nbsp;If you go out of status, you may have to return to your home country to obtain green card and risk the 10-year bar.</span><br /> <br /> <em><span>Tip</span></em><span>: &nbsp;Because the new I-130 is filed for you in the F2B category, while waiting for the priority date to be current, have parent file N-400 to become citizen if priority dates move faster in the F1 category (unmarried son/daughter 21 or over of citizen) according to the official monthly Visa Bulletin. &nbsp;If parent files for citizenship anyway, you will be automatically converted from the F2B category to F1, but you have the right to 'opt out' and stay in F2B if priority dates are moving faster with F2B.</span></span></p>",

  "P51_H11_TITLE": "Have parent file I-130 petition for you under the F1 category (unmarried sons/daughters 21 or over of citizens); or if the I-130 already filed and has priority date current under the F2A category, it's now been converted to F1 with the same priority date. \nWait until the petition is approved and has priority date current under F1 category. ",
  "P51_H11_TITLE_BODY":"<p><span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.&nbsp;&nbsp;&nbsp;&nbsp;</span><span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and your parent here exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.<em><br /> <br /> <span>Note:</span></em>&nbsp; It may take many years for the priority date to be current under this F1 category, so you should plan ahead and strive to take steps to maintain legal status in the US on your existing nonimmigrant visa or change to another type of visa. &nbsp;If you go out of status, you may have to return to your home country to obtain green card and risk the 10-year bar.</span></span></p>",

  "P51_H12_TITLE": "It appears you don't have a parent or sibling who can directly petition for you to immigrate.",

  "P51_OV1_TITLE": "The petition filed by your parent for you in the F2A category has been converted to an immediate relative petition and the priority date is immediately current.  File I-485 application for green card.",
  "P51_OV1_TITLE_BODY":"An immediate relative petition is not subject to annual quota which means there's no need to wait for its priority date to be current.",

  "P51_OV2_TITLE": "File I-485 application for green card.  Your unmarried children under 21 (if any) are also eligible to file the I-485 (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",
  "P51_OV2_TITLE_BODY":"<p><em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must file the I-485 application&nbsp;<em><span>within one year after</span></em>&nbsp;the&nbsp;date when a visa number became or will become available for you under the F2A category.</span></p>",


  "P51_OV3_TITLE": "File I-485 and I-485A applications for green card.  Your unmarried children under 21 (if any) are also eligible to file the I-485 and possibly the I-485A (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",
  "P51_OV3_TITLE_BODY":"<p><em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must file the I-485 application&nbsp;<em><span>within one year after</span></em>&nbsp;the&nbsp;date when a visa number became or will become available for you under the F2A category.</span></p>",


  "P51_OV4_TITLE": "Since you will be out of status in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card).  If out of status for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval before going back to home country. \nYour unmarried children under 21 (if any) will also be eligible to go through the same process, and must file the I-601A or I-601 waiver, too, if they were out of status/unlawfully present for more than 180 days in the US.",
  "P51_OV4_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em>not</em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.). &nbsp;Same thing applies to your children.<br /> <br /> <em>Importan</em>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must take the step to obtain the immigrant visa&nbsp;<em>within one year after</em>&nbsp;the&nbsp;date when a visa number became or will become available for you under the F2A category.</span></p>",

  "P51_OV5_TITLE": "File I-485 application for green card.  Your spouse (only when the petition was under F3 or F4 category) and your unmarried children under 21 (if any) are also eligible to file the I-485 (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",
  "P51_OV5_TITLE_BODY":"<p><span>F3&nbsp;category: &nbsp;married sons/daughters of citizens &nbsp;</span><span><br /> <span>F4 category: &nbsp;siblings of 21 or over citizens&nbsp;</span><br /> <em><span><br /> <span>Tip</span></span></em><span>: &nbsp;If the I-130 was filed for you by your parent in the F2B category (unmarried sons/daughters 21 or over of green-card holders) and you wish your partner to be able to immigrate with you, you&nbsp;<em><span>must</span></em>&nbsp;marry him or her&nbsp;<em><span>after</span></em>&nbsp;your parent become a citizen, not before, so that the petition is converted to the F3 category.</span></span></p>",

  "P51_OV6_TITLE": "File I-485 and I-485A applications for green card.  Your spouse (only when the petition was under F3 or F4 category) and your unmarried children under 21 (if any) are also eligible to file the I-485 and possibly the I-485A (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",
  "P51_OV6_TITLE_BODY":"<p><span>F3&nbsp;category: &nbsp;married sons/daughters of citizens &nbsp;</span><span><br /> <span>F4 category: &nbsp;siblings of 21 or over citizens&nbsp;</span><br /> <em><span><br /> <span>Tip</span></span></em><span>: &nbsp;If the I-130 was filed for you by your parent in the F2B category (unmarried sons/daughters 21 or over of green-card holders) and you wish your partner to be able to immigrate with you, you&nbsp;<em><span>must</span></em>&nbsp;marry him or her&nbsp;<em><span>after</span></em>&nbsp;your parent become a citizen, not before, so that the petition is converted to the F3 category.</span></span></p>",

  "P51_OV7_TITLE": "Since you will be out of status in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card).  If out of status for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval before going back to home country. \nYour spouse (only when the petition was under F3 or F4 category) and your unmarried children under 21 (if any) will also be eligible to go through the same process, and must file the I-601A or I-601 waiver, too, if they were out of status/unlawfully present for more than 180 days in the US.",
  "P51_OV7_TITLE_BODY":"<p><span>F3&nbsp;category: &nbsp;married sons/daughters of citizens&nbsp;</span><span><br /> <span>F4 category: &nbsp;siblings of 21 or over citizens<em><br /> <br /> <span>Note</span></em>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em><span>not</span></em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.). &nbsp;Same thing applies to your spouse and children.</span><br /> <br /> <span>If the petition was under F4 category, you must have a citizen/green card parent or spouse before you can file the I-601A waiver. &nbsp;If no such parent or spouse, will be subject to 3- or 10-year bar.</span><br /> <em><span><br /> <span>Tip</span></span></em><span>: &nbsp;If the I-130 was filed for you by your parent in the F2B category (unmarried sons/daughters 21 or over of green-card holders) and you wish your partner to be able to immigrate with you, you&nbsp;<em><span>must</span></em>&nbsp;marry him or her&nbsp;<em><span>after</span></em>&nbsp;your parent become a citizen, not before, so that the petition is converted to the F3 category.</span></span></p>",


  "P52_D1_TITLE": "Have you been petitioned for in the past for green card or immigrant status by your US citizen/green card parent or citizen sibling, with filing of an I-130 petition?",
  "P52_D1_TITLE_BODY":"<p><em><span>Note: &nbsp;</span></em><span>the term&nbsp;\"parent\" can also include your step-parent, as long as he or she was married to your natural parent before you turned 18.</span></p>",

  "P52_D2_TITLE": "Is that parent now a US citizen?",

  "P52_D3_TITLE": "Did that parent become citizen when you were still under 21?",

  "P52_D4_TITLE": "Did you marry before your parent became citizen?",
  "P52_D4_TITLE_BODY":"<p><span>If the petition filed for you by your parent was in the F2B category (unmarried son/daughter 21 and over of green-card holder), unfortunately it would be invalid if you got married<em><span>&nbsp;before</span></em>&nbsp;your parent became a citizen.</span></p>",

  "P52_D5_TITLE": "Would your parent apply for citizenship if qualified to do so at this time (had green card for at least 5 years, or 3 in some cases) or in the future?",
  "P52_D5_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;because you are now married, your parent having citizenship rather than just green card will prevent the petition filed for you from being invalidated.&nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history.</span></p>",

  "P52_D6_TITLE": "Is your effective age just computed under 21?",

  "P52_D7_TITLE": "Do you have any US citizen/green card parent willing to file an I-130 petition for you?",
  "P52_D7_TITLE_BODY":"<p><em><span>Note: &nbsp;</span></em><span>a&nbsp;\"parent\" can also include your step-parent, as long as he or she was married to your natural parent before you turned 18.</span><span><br /> <br /> <span>If your parent only has a green card and you are married, he or she cannot file a petition for you. &nbsp;If that is the case, please select 'No'.</span></span></p>",

  "P52_D8_TITLE": "Are you from Mexico?",
  "P52_D8_TITLE_BODY":"If you are from Mexico, you could benefit from having a check on whether you have a US citizen sibling who could petition for you in the next step, since for Mexicans the F4 category of siblings is moving a few years faster than the one where you are petitioned for by your parent.",

  "P52_D9_TITLE": "Do you have any US citizen sibling 21 or over willing to file an I-130 petition for you?",

  "P52_D10_TITLE": "Even though we've just gone through the possible direct petitioning by your parent or sibling for you for green card, it's suggested that you continue and see whether a parent was themselves previously petitioned for by their own parent, sibling or employer, because you might be able to benefit indirectly as a derivative and receive green card faster (if petition for parent was filed long enough ago).  If so, please answer Yes.",
  "P52_D10_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;these other methods may be slower or faster than the method(s) that have been recommended for you so far. &nbsp;It's important to see what your possible options are, however.</span></p>",

  "P52_D11_TITLE": "Are you from Mexico?",
  "P52_D11_TITLE_BODY":"If you are from Mexico, you could benefit from having a check on whether you have a US citizen sibling in the next step, since for Mexicans the F4 category of siblings is moving a few years faster than the one where you are petitioned for by your parent.",

  "P52_OC1_TITLE": "Was petition filed for you in the following way (choose one)?",
  "P52_OC1_OPTIONA":"By parent who had green card and you were under 21 and unmarried at the time (petition under F2A category)",
  "P52_OC1_OPTIONB":"By parent who had green card and you were 21 or over and unmarried at the time (petition under F2B category)",
  "P52_OC1_OPTIONC":"By parent who was a citizen and you were 21 or over and unmarried at the time (petition under F1 category)",
  "P52_OC1_OPTIOND":"By parent who was a citizen and you were married at the time (petition under F3 category)",
  "P52_OC1_OPTIONE":"By sibling who was a citizen 21 or over at the time (petition under F4 category)",

  "P52_H1_TITLE": "Unfortunately, the petition filed by your parent for you in the F2B category has been invalidated because you married before your parent became a citizen.  A new I-130 petition with a new priority date would have to be filed for you. \nIf that same parent has had a green card for at least 5 yrs (3 in some cases), he or she should file an N-400 application to become a citizen then afterward file a new petition for you under the F3 category (married sons/daughters of citizens).  If that same parent is already a citizen, he or she should file a new petition for you under F3.  If your other parent is a citizen he or she can also file a new petition for you under F3. \nIf you have a citizen sibling 21 or over, he or she can file a new petition for you in the F4 category.",
  "P52_H1_TITLE_BODY":"<p><em><span>Note: &nbsp;</span></em><span>a&nbsp;\"parent\" can also include your step-parent, as long as he or she was married to your natural parent before you turned 18.</span><span><br /> <br /> <span>It's very well possible that you may have both a parent and a sibling where either or both could petition for you as in the next steps, and usually you'll go with the person whose category will move faster. &nbsp;Almost always that will be your parent petitioning for you rather than your sibling although you must check the Visa Bulletin to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if you're a Mexican citizen, a petition by your sibling for you is moving faster than one by your parent by a few years.</span></span></p>",

  "P52_H2_TITLE": "Unfortunately, the petition filed by your parent for you in the F2A category has been invalidated because you're now married and your parent is unwilling or unable to file for citizenship.  A new I-130 petition with a new priority date would have to be filed for you by a new relative. \nIf your other parent is a citizen he or she should file a new petition for you in the F3 category (married sons/daughters of citizens). \nIf you have a citizen sibling 21 or over, he or she can file a new petition for you in the F4 category.",
  "P52_H2_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.<br /> <br /> It's very well possible that your spouse may have a parent, sibling or employer, where any of them (or all) could petition for your spouse, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your spouse rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your spouse is a Mexican citizen, a petition by your spouse's sibling for him or her is moving faster than one by his or her parent by a few years.</span></p>",

  "P52_H3_TITLE": "Have parent file N-400 application to become US citizen and wait until approval.",

  "P52_H4_TITLE": "Have such parent file I-130 petition for you.",

  "P52_H5_TITLE": "The petition filed by parent for you has been converted to the F3 category (married sons/daughters of citizens).",

  "P52_H6_TITLE": "Have such sibling file I-130 petition for you.",
  "P52_H6_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;If you're from Mexico and there's such a sibling, we're assuming he or she is willing to petition for you. &nbsp;If not, and you have a parent who's willing to petition for you instead, you can restart the app and answer the question as if you have no such sibling.</span></p>",

  "P52_H7_TITLE": "Wait until the petition filed for you is approved and has priority date current under the appropriate category (unless it's already approved and has priority date current).",
  "P52_H7_TITLE_BODY": "<p><span>F1 category = unmarried sons/daughters (21 or over) of citizens</span><span><br /> <span>F2A = spouses and unmarried children (under 21) of green-card holders</span><br /> <span>F2B = unmarried sons/daughters (21 or over) of green-card holders</span><br /> <span>F3 = married sons/daughters of citizens</span><br /> <span>F4 = siblings of 21 or over citizens</span><br /> <br /> <span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card. &nbsp;&nbsp;</span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and petitioner (your parent or sibling here) exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span><br /> <em><span><br /> <span>Tip</span></span></em><span>: &nbsp;If the I-130 was filed for you by your parent under F2B category, and while waiting for your priority date to be current, have parent file to become citizen if priority dates move faster under F1 category. &nbsp;If parent files for citizenship anyway, you will be automatically converted from F2B to F1, but you have the right to 'opt out' and stay in F2B if priority dates are moving faster with F2B.</span></span></p>",

  "P52_H8_TITLE": "The petition filed by your parent for you in the F2A category has been converted to an immediate relative petition and the priority date is immediately current.",
  "P52_H8_TITLE_BODY":"An immediate relative petition is not subject to annual quota which means there's no need to wait for its priority date to be current.",

  "P52_H9_TITLE": "The petition filed by parent for you has been converted to the F1 category (unmarried sons/daughters 21 or over of citizens).",

  "P52_H10_TITLE": "Because you are now over 21 but trying to benefit from a petition for a child under 21 (F2A), you may have 'aged-out' unless your 'effective age' is under 21.  Compute your effective age as follows:  (1) determine your age on the date when a visa number became or will become available for you under the F2A category (which is the date in the Visa Bulletin when your petition's priority date became or will become current or the petition's approval date itself, whichever is later), then (2) reduce that age by the number of days the petition was or will be pending.",

  "P52_H11_TITLE": "If your effective age will be 21 or over, your parent, who is or will still be a green-card holder, should file a new petition for you in the F2B category (unmarried sons/daughters 21 or over of green-card holders), which is a much slower category.  However, that petition will get the same priority date as the previous petition filed under F2A category for you. \nWait until the new petition is approved and has priority date current under F2B.",
  "P52_H11_TITLE_BODY":"<p><span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card. &nbsp;&nbsp;</span><span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and your parent here) exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span><br /> <em><span><br /> <span>Tip</span></span></em><span>: &nbsp;Because the new I-130 is filed for you in the F2B category, while waiting for the priority date to be current, have parent file N-400 to become citizen if priority dates move faster in the F1 category (unmarried son/daughter 21 or over of citizen) according to the official monthly Visa Bulletin. &nbsp;If parent files for citizenship anyway, you will be automatically converted from the F2B category to F1, but you have the right to 'opt out' and stay in F2B if priority dates are moving faster with F2B.</span></span><span>&nbsp;</span></p>",

  "P52_H12_TITLE": "Have parent file I-130 petition for you under the F1 category (unmarried sons/daughters 21 or over of citizens); or if the I-130 already filed and has priority date current under the F2A category, it's now been converted to F1 with the same priority date. \nWait until the petition is approved and has priority date current under F1 category.",
  "P52_H12_TITLE_BODY":"<p><span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.&nbsp;&nbsp;&nbsp;&nbsp;</span><span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and your parent here exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.<em><br /> <br /> <br /> </em></span></span></p>",

  "P52_H13_TITLE": "It appears you don't have a parent or sibling who can directly petition for you to immigrate.",

  "P52_OV1_TITLE": "File I-485 application for green card.",

  "P52_OV2_TITLE": "File I-485 and I-485A applications for green card.",

  "P52_OV3_TITLE": "Wait for the petition filed by your parent for you in the F2A category to be approved if not approved already.  Then, since you are out of status/unlawfully present in the US, you must go through consular processing and interview in your home country to receive immigrant visa (green card).  If out of status/unlawfully present for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval before going back to home country.",
  "P52_OV3_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em><span>not</span></em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.)</span></p>",

  "P52_OV4_TITLE": "File I-485 and I-485A applications for green card.  Your unmarried children under 21 (if any) are also eligible to file the I-485 and possibly the I-485A (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",
  "P52_OV4_TITLE_BODY":"<p><em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must file the I-485 application&nbsp;<em><span>within one year after</span></em>&nbsp;the&nbsp;date when a visa number became or will become available for you under the F2A category.</span></p>",

  "P52_OV5_TITLE": "Since you are out of status/unlawfully present in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card).  If out of status/unlawfully present for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval before going back to home country. \nYour unmarried children under 21 (if any) are also eligible to go through the same process, and must file the I-601A or I-601 waiver, too, if they were out of status/unlawfully present for more than 180 days in the US.",
  "P52_OV5_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em><span>not</span></em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.). &nbsp;Same thing applies to your children.</span><span><br /> <br /> <em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must take the step to obtain the immigrant visa&nbsp;<em><span>within one year after</span></em>&nbsp;the&nbsp;date when a visa number became or will become available for you under the F2A category.</span></span></p>",

  "P52_OV6_TITLE": "File I-485 and I-485A applications for green card.  Your spouse (only when the petition was under F3 or F4 category) and your unmarried children under 21 (if any) are also eligible to file the I-485 and possibly the I-485A (if they're also in US) or go through consular processing and interview in your home country (if they're not in US) to receive immigrant visas (green cards).",
  "P52_OV6_TITLE_BODY":"<p><span>F3&nbsp;category: &nbsp;married sons/daughters of citizens &nbsp;</span><span><br /> <span>F4 category: &nbsp;siblings of 21 or over citizens&nbsp;</span><br /> <em><span><br /> <span>Tip</span></span></em><span>: &nbsp;If the I-130 was filed for you by your parent in the F2B category (unmarried sons/daughters 21 or over of green-card holders) and you wish your partner to be able to immigrate with you, you&nbsp;<em><span>must</span></em>&nbsp;marry him or her&nbsp;<em><span>after</span></em>&nbsp;your parent become a citizen, not before, so that the petition is converted to the F3 category.</span></span></p>",

  "P52_OV7_TITLE": "Since you are out of status/unlawfully present in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card).  If out of status/unlawfully present for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval before going back to home country. \nYour spouse (only when the petition was under F3 or F4 category) and your unmarried children under 21 (if any) are also eligible to go through the same process, and must file the I-601A or I-601 waiver, too, if they were out of status/unlawfully present for more than 180 days in the US.",
  "P52_OV7_TITLE_BODY":"<p><span>F3&nbsp;category: &nbsp;married sons/daughters of citizens&nbsp;</span><span><br /> <span>F4 category: &nbsp;siblings of 21 or over citizens<em><br /> <br /> <span>Note</span></em>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em><span>not</span></em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.). &nbsp;Same thing applies to your spouse and children.</span><br /> <br /> <span>If the petition was under F4 category, you must have a citizen/green card parent or spouse before you can file the I-601A waiver. &nbsp;If no such parent or spouse, will be subject to 3- or 10-year bar.</span><br /> <em><span><br /> <span>Tip</span></span></em><span>: &nbsp;If the I-130 was filed for you by your parent in the F2B category (unmarried sons/daughters 21 or over of green-card holders) and you wish your partner to be able to immigrate with you, you&nbsp;<em><span>must</span></em>&nbsp;marry him or her&nbsp;<em><span>after</span></em>&nbsp;your parent become a citizen, not before, so that the petition is converted to the F3 category.</span></span></p>",

  "P53_D1_TITLE": "Have you been petitioned for in the past for green card or immigrant status by your US citizen/green card parent or citizen sibling, with filing of an I-130 petition?",
  "P53_D1_TITLE_BODY": "<p><em><span>Note: &nbsp;</span></em><span>the term&nbsp;\"parent\" can also include your step-parent, as long as he or she was married to your natural parent before you turned 18.</span></p>",

  "P53_D2_TITLE": "Is that parent now a US citizen?",

  "P53_D3_TITLE": "Did that parent become citizen when you were still under 21?",

  "P53_D4_TITLE": "Did you marry before your parent became citizen?",
  "P53_D4_TITLE_BODY": "If the petition filed for you by your parent was in the F2B category (unmarried son/daughter 21 and over of green-card holder), unfortunately it would be invalid if you got married before your parent became a citizen.",

  "P53_D5_TITLE": "Would your parent apply for citizenship if qualified to do so at this time (had green card for at least 5 years, or 3 in some cases) or in the future?",
  "P53_D5_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;because you are now married, your parent having citizenship rather than just green card will prevent the petition filed for you from being invalidated.&nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history.</span></p>",

  "P53_D6_TITLE": "Is your effective age just computed under 21?",

  "P53_D7_TITLE": "Do you have any US citizen/green card parent willing to file an I-130 petition for you?",
  "P53_D7_TITLE_BODY": "<p><em><span>Note: &nbsp;</span></em><span>a&nbsp;\"parent\" can also include your step-parent, as long as he or she was married to your natural parent before you turned 18.</span><span><br /> <br /> <span>If your parent only has a green card and you are married, he or she cannot file a petition for you. &nbsp;If that is the case, please select 'No'. &nbsp;</span></span></p>",

  "P53_D8_TITLE": "Are you from Mexico?",
  "P53_D8_TITLE_BODY": "If you are from Mexico, you could benefit from having a check on whether you have a US citizen sibling who could petition for you in the next step, since for Mexicans the F4 category of siblings is moving a few years faster than the one where you are petitioned for by your parent.",

  "P53_D9_TITLE": "Do you have any US citizen sibling 21 or over willing to file an I-130 petition for you?",

  "P53_D10_TITLE": "Even though we've just gone through the possible direct petitioning by your parent or sibling for you for green card, it's suggested that you continue and see whether a parent was themselves previously petitioned for by their own parent, sibling or employer, because you might be able to benefit indirectly as a derivative and receive green card faster (if petition for parent was filed long enough ago).  If so, please answer Yes.",
  "P53_D10_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;these other methods may be slower or faster than the method(s) that have been recommended for you so far. &nbsp;It's important to see what your possible options are, however.</span></p>",

  "P53_D11_TITLE": "Are you from Mexico?",
  "P53_D11_TITLE_BODY": "If you are from Mexico, you could benefit from having a check on whether you have a US citizen sibling in the next step, since for Mexicans the F4 category of siblings is moving a few years faster than the one where you are petitioned for by your parent.",

  "P53_OC1_TITLE": "Was petition filed for you in the following way (choose one)?",
  "P53_OC1_OPTIONA": "By parent who had green card and you were under 21 and unmarried at the time (petition under F2A category)",
  "P53_OC1_OPTIONB": "By parent who had green card and you were 21 or over and unmarried at the time (petition under F2B category)",
  "P53_OC1_OPTIONC": "By parent who was a citizen and you were 21 or over and unmarried at the time (petition under F1 category)",
  "P53_OC1_OPTIOND": "By parent who was a citizen and you were married at the time (petition under F3 category)",
  "P53_OC1_OPTIONE": "By sibling who was a citizen 21 or over at the time (petition under F4 category)",

  "P53_H1_TITLE": "Unfortunately, the petition filed by your parent for you in the F2B category has been invalidated because you married before your parent became a citizen.  A new I-130 petition with a new priority date would have to be filed for you. \nIf that same parent has had a green card for at least 5 yrs (3 in some cases), he or she should file an N-400 application to become a citizen then afterward file a new petition for you under the F3 category (married sons/daughters of citizens).  If that same parent is already a citizen, he or she should file a new petition for you under F3.  If your other parent is a citizen he or she can also file a new petition for you under F3. \nIf you have a citizen sibling 21 or over, he or she can file a new petition for you in the F4 category.",
  "P53_H1_TITLE_BODY":"<p><em><span>Note: &nbsp;</span></em><span>a&nbsp;\"parent\" can also include your step-parent, as long as he or she was married to your natural parent before you turned 18.</span><span><br /> <br /> <span>It's very well possible that you may have both a parent and a sibling where either or both could petition for you as in the next steps, and usually you'll go with the person whose category will move faster. &nbsp;Almost always that will be your parent petitioning for you rather than your sibling although you must check the Visa Bulletin to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if you're a Mexican citizen, a petition by your sibling for you is moving faster than one by your parent by a few years.</span></span></p>",

  "P53_H2_TITLE": "Unfortunately, the petition filed by your parent for you in the F2A category has been invalidated because you're now married and your parent is unwilling or unable to file for citizenship.  A new I-130 petition with a new priority date would have to be filed for you by a new relative. \nIf your other parent is a citizen he or she should file a new petition for you in the F3 category (married sons/daughters of citizens). \nIf you have a citizen sibling 21 or over, he or she can file a new petition for you in the F4 category.",
  "P53_H2_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;a \"parent\" of your spouse can also include his or her step-parent, as long as that step-parent was married to your spouse's natural parent before spouse turned 18.<br /> <br /> It's very well possible that your spouse may have a parent, sibling or employer, where any of them (or all) could petition for your spouse, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your spouse rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your spouse is a Mexican citizen, a petition by your spouse's sibling for him or her is moving faster than one by his or her parent by a few years.</span></p>",

  "P53_H3_TITLE": "Have parent file N-400 application to become US citizen and wait until approval.",

  "P53_H4_TITLE": "Have such parent file I-130 petition for you.",

  "P53_H5_TITLE": "The petition filed by parent for you has been converted to the F3 category (married sons/daughters of citizens)",

  "P53_H6_TITLE": "Have such sibling file I-130 petition for you.",
  "P53_H6_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;If you're from Mexico and there's such a sibling, we're assuming he or she is willing to petition for you. &nbsp;If not, and you have a parent who's willing to petition for you instead, you can restart the app and answer the question as if you have no such sibling.</span></p>",

  "P53_H7_TITLE": "Wait until the petition filed for you is approved and has priority date current under the appropriate category (unless it's already approved and has priority date current).",
  "P53_H7_TITLE_BODY":"<p><span>F1 category = unmarried sons/daughters (21 or over) of citizens</span><span><br /> <span>F2A = spouses and unmarried children (under 21) of green-card holders</span><br /> <span>F2B = unmarried sons/daughters (21 or over) of green-card holders</span><br /> <span>F3 = married sons/daughters of citizens</span><br /> <span>F4 = siblings of 21 or over citizens</span><br /> <br /> <span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card. &nbsp;&nbsp;</span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and petitioner (your parent or sibling here) exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span><br /> <em><span><br /> <span>Tip</span></span></em><span>: &nbsp;If the I-130 was filed for you by your parent under F2B category, and while waiting for your priority date to be current, have parent file to become citizen if priority dates move faster under F1 category. &nbsp;If parent files for citizenship anyway, you will be automatically converted from F2B to F1, but you have the right to 'opt out' and stay in F2B if priority dates are moving faster with F2B.</span></span></p>",

  "P53_H8_TITLE": "The petition filed by parent for you has been converted to the F1 category (unmarried sons/daughters 21 or over of citizens).",

  "P53_H9_TITLE": "Because you are now over 21 but trying to benefit from a petition for a child under 21 (F2A), you may have 'aged-out' unless your 'effective age' is under 21.  Compute your effective age as follows:  (1) determine your age on the date when a visa number became or will become available for you under the F2A category (which is the date in the Visa Bulletin when your petition's priority date became or will become current or the petition's approval date itself, whichever is later), then (2) reduce that age by the number of days the petition was or will be pending.",

  "P53_H10_TITLE": "If your effective age will be 21 or over, your parent, who is or will still be a green-card holder, should file a new petition for you in the F2B category (unmarried sons/daughters 21 or over of green-card holders), which is a much slower category.  However, that petition will get the same priority date as the previous petition filed under F2A category for you. \nWait until the new petition is approved and has priority date current under F2B.",
  "P53_H10_TITLE_BODY":"<p><span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card. &nbsp;&nbsp;</span><span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and your parent here) exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span><br /> <em><span><br /> <span>Tip</span></span></em><span>: &nbsp;Because the new I-130 is filed for you in the F2B category, while waiting for the priority date to be current, have parent file N-400 to become citizen if priority dates move faster in the F1 category (unmarried son/daughter 21 or over of citizen) according to the official monthly Visa Bulletin. &nbsp;If parent files for citizenship anyway, you will be automatically converted from the F2B category to F1, but you have the right to 'opt out' and stay in F2B if priority dates are moving faster with F2B.</span></span><span>&nbsp;</span></p>",

  "P53_H11_TITLE": "Have parent file I-130 petition for you under the F1 category (unmarried sons/daughters 21 or over of citizens); or if the I-130 already filed and has priority date current under the F2A category, it's now been converted to F1 with the same priority date. \nWait until the petition is approved and has priority date current under F1 category.",
  "P53_H11_TITLE_BODY":"<p><span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your petition's priority date, the sooner there will be a visa number available for you. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.&nbsp;&nbsp;&nbsp;&nbsp;</span><span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between you and your parent here exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.<em><br /> <br /> <br /> </em></span></span></p>",

  "P53_H12_TITLE": "It appears you don't have a parent or sibling who can directly petition for you to immigrate. ",

  "P53_OV1_TITLE": "The petition filed by your parent for you in the F2A category has been converted to an immediate relative petition and the priority date is immediately current.  You go through consular processing and interview in your home country to receive immigrant visa (green card).",
  "P53_OV1_TITLE_BODY":"An immediate relative petition is not subject to annual quota which means there's no need to wait for its priority date to be current.",

  "P53_OV2_TITLE": "You go through consular processing and interview in your home country to receive immigrant visa (green card).  Your unmarried children under 21 (if any) will also be eligible to receive immigrant visas but only as your dependents.",
  "P53_OV2_TITLE_BODY":"<p><em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must take the step to obtain the immigrant visa&nbsp;<em>within one year after</em>&nbsp;the&nbsp;date when a visa number became or will become available for you under the F2A category.</span></p>",

  "P53_OV3_TITLE": "You go through consular processing and interview in your home country to receive immigrant visa (green card).  Your spouse (only when the petition was under F3 or F4 category) and your unmarried children under 21 (if any) will also be eligible to receive immigrant visas but only as your dependents.",
  "P53_OV3_TITLE_BODY":"<p><span>F3&nbsp;category: &nbsp;married sons/daughters of citizens &nbsp;</span><span><br /> <span>F4 category: &nbsp;siblings of 21 or over citizens&nbsp;</span><br /> <em><span><br /> <span>Tip</span></span></em><span>: &nbsp;If the I-130 was filed for you by your parent in the F2B category (unmarried sons/daughters 21 or over of green-card holders) and you wish your partner to be able to immigrate with you, you&nbsp;<em><span>must</span></em>&nbsp;marry him or her&nbsp;<em><span>after</span></em>&nbsp;your parent become a citizen, not before, so that the petition is converted to the F3 category.</span></span></p>",

  "P61_D1_TITLE": "Has your parent been petitioned for in the past for green card or immigrant status by his or her US citizen/green card parent (your grandparent), citizen sibling (your aunt or uncle), with filing of an I-130 petition, or US employer with filing of a labor certification and an I-140 petition, and in any case the filing occurred before you turned 21?",
  "P61_D1_TITLE_BODY": "<p><em><span>Note: &nbsp;</span></em><span>a \"parent\" of your parent can also include his or her step-parent, as long as that step-parent was married to your parent's natural parent before your parent turned 18. &nbsp;Also, \"your&nbsp;parent\" can also include your step-parent, as long as that step-parent was married to your natural parent before you turned 18. &nbsp;</span></p>",

  "P61_D2_TITLE": "Is your parent now married?",
  "P61_D2_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;your parent being now married will automatically convert the petition filed for him or her in the F1 category (unmarried sons/daughters of citizens) to F3 (married sons/daughters of citizens), which may be a slower or faster category with the priority date. &nbsp;This can be confirmed by checking the Visa Bulletin. &nbsp;Conversely, if the petition filed for him or her was in the F3 category, your parent being now unmarried will automatically convert the petition to F1.</span><span><br /> <br /> <span>If the petition filed for your parent by your grandparent was in the F2A or F2B category, it may now be invalid because your parent is married, and therefore the early priority date of that petition from before cannot be taken advantage of. &nbsp;A new petition with a new priority date would have to be filed for your parent, unless your grandparent already is or can now become a citizen and the petition was F2A category,&nbsp;in which case the old petition would still be valid and converted to the F3 category with the old priority date preserved.</span></span></p>",

  "P61_D3_TITLE": "Is that grandparent a US citizen now?",

  "P61_D4_TITLE": "Did that grandparent become citizen when your parent was still under 21?",

  "P61_D5_TITLE": "Did your parent marry before your grandparent became citizen?",
  "P61_D5_TITLE_BODY": "If the petition filed for your parent by your grandparent was in the F2B category (unmarried son/daughter 21 and over of green-card holder), unfortunately it would be invalid if your parent got married before your grandparent became a citizen.",

  "P61_D6_TITLE": "Would that grandparent apply for citizenship if qualified to do so at this time (had green card for at least 5 years, or 3 in some cases) or in the future?",
  "P61_D6_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;because your parent is now married, your grandparent having citizenship rather than just green card will prevent the petition filed for your parent from being invalidated. &nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history.</span></p>",

  "P61_D7_TITLE": "Does parent have any US citizen/green card parent (your grandparent), citizen sibling 21 or over (your aunt or uncle), or US employer willing to file an I-130 or I-140 petition for him or her?",
  "P61_D7_TITLE_BODY": "<p><em><span>Note: &nbsp;</span></em><span>a \"parent\" of your parent can also include his or her step-parent, as long as that step-parent was married to your parent's natural parent before your parent turned 18. &nbsp;Also, \"your&nbsp;parent\" can also include your step-parent, as long as that step-parent was married to your natural parent before you turned 18. &nbsp;</span><span><br /> <br /> <span>If your grandparent has a green card, he or she can only petition for your parent if your parent is unmarried. &nbsp;There is no category for green-card holders to petition for their married children.<em><br /> <br /> </em>It's very well possible that your parent may have a parent, sibling or employer, where any of them (or all) could petition for your parent, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your parent rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your parent is a Mexican citizen, a petition by your parent's sibling for him or her is moving faster than one by his or her parent by a few years.&nbsp;</span></span></p>",

  "P61_D8_TITLE": "Will your age still be or was under 21 by that time?",

  "P61_D9_TITLE": "Will you have maintained status in US by that time?",

  "P61_D10_TITLE": "Is your effective age just computed under 21?",

  "P61_D11_TITLE": "Did your parent already receive his/her green card and you were unable to immigrate with them?",
  "P61_D11_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;If yes, then most likely when your parent was ready for the final processing step to immigrate to the US (receive the green card), you were 21 or over, or \"aged out,\" and were found to be no longer eligible to accompany your parent to immigrate.</span><span><br /> <br /> <span>Also, please keep in mind that if your parent has already received green card then in the previous step in this app you were asked about whether that parent has already petitioned directly for you or asked about that parent possibly petitioning for you.</span></span></p>",

  "P61_D12_TITLE": "Look back at the date when a visa number became available for your parent (which is the date in the Visa Bulletin when the priority date of the petition filed for your parent became current or the petition's approval date itself, whichever is later).  Are you here at this app one year or less after that date?",

  "P61_D13_TITLE": "Are you from Mexico?",
  "P61_D13_TITLE_BODY": "If you are from Mexico, you could benefit from having a check on whether you have a US citizen sibling in the next step, since for Mexicans the F4 category of siblings is moving a few years faster than the one where you are petitioned for by your parent.",

  "P61_OC1_TITLE": "Was petition filed for your parent in the following way (choose one)?",
  "P61_OC1_OPTIONA":"By grandparent who had green card and parent was under 21 and unmarried at the time (petition under F2A category)",
  "P61_OC1_OPTIONB":"By grandparent who had green card and parent was 21 or over and unmarried at the time (petition under F2B category)",
  "P61_OC1_OPTIONC":"By grandparent who was a citizen and parent was 21 or over and unmarried at the time (petition under F1 category)",
  "P61_OC1_OPTIOND":"By grandparent who was a citizen and parent was married at the time (petition under F3 category)",
  "P61_OC1_OPTIONE":"By parent's sibling who was a citizen 21 or over at the time (petition under F4 category) or by US employer",
  "P61_OC1_OPTIONF":"NEW OPTION ADDED By parent's sibling who was a citizen 21 or over at the time (petition under F4 category) or by US employer",
  "P61_OC1_TITLE_NOTE":"<p><em><span>Note</span></em><span>: &nbsp;if it's actually your step-parent we're dealing with, then by the term \"grandparent\"&nbsp;it's understood that we're actually referring to your step-parent's parent&nbsp;or even your step-parent's step-parent.</span></p>",

  "P61_H1_TITLE": "The petition filed by grandparent for your parent has been converted to an immediate relative petition.  Unfortunately, that petition can only help or did help your parent to immigrate but not you.",

  "P61_H2_TITLE": "The petition filed by grandparent for your parent has been converted to the F3 category (married sons/daughters of citizens).",

  "P61_H3_TITLE": "The petition filed by grandparent for your parent has been converted to the F1 category (unmarried sons/daughters 21 or over of citizens).",

  "P61_H4_TITLE": "Have grandparent file N-400 application to become US citizen and wait until approval.",

  "P61_H5_TITLE": "Wait until the petition for your parent is approved and has priority date current under the appropriate category (unless it's already approved and has priority date current).  Then, estimate or take note of what your age at that time will be (or was if the priority date already current).",
  "P61_H5_TITLE_BODY":"<p><span>F1 category = unmarried sons/daughters (21 or over) of citizens</span><span><br /> <span>F2A = spouses and unmarried children (less than 21) of green-card holders</span><br /> <span>F2B = unmarried sons/daughters (21 or over) of green-card holders</span><br /> <span>F3 = married sons/daughters of citizens</span><br /> <span>F4 = siblings of 21 or over citizens</span><br /> <br /> <span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your parent's petition's priority date, the sooner there will be a visa number available for him or her. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.&nbsp;&nbsp;&nbsp;&nbsp;</span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between your parent and petitioner (his or her parent or sibling or employer here) exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span><br /> <br /> <em><span>Tip</span></em><span>: &nbsp;If the I-130 was filed for your parent by your grandparent under F2B category, and while waiting for the &nbsp;priority date to be current, have grandparent file to become citizen if priority dates move faster under F1 category. &nbsp;If grandparent files for citizenship anyway, your parent will be automatically converted from F2B to F1, but your parent has the right to 'opt out' and stay in F2B if priority dates are moving faster with F2B.</span></span></p>",

  "P61_H6_TITLE": "Unfortunately, the petition filed by your grandparent for parent in the F2B category has been invalidated because your parent married before your grandparent became a citizen.  A new I-130 petition with a new priority date would have to be filed for your parent. \nIf that same grandparent has had a green card for at least 5 yrs (3 in some cases), he or she should file an N-400 application to become a citizen then afterward file a new petition for your parent under the F3 category (married sons/daughters of citizens).  If that same grandparent is already a citizen, he or she should file a new petition for your parent under F3.  If your other grandparent is a citizen he or she can also file a new petition for your parent under F3, not to mention your other set of grandparents who could petition for your other parent. \nIf your parent has a citizen sibling 21 or over, he or she can file a new petition for your parent in the F4 category. \nIf your parent has a US employer willing to sponsor him or her, it can file a labor certification for your parent (if one is necessary), then an I-140 petition for him or her in an employment category.",
  "P61_H6_TITLE_BODY":"<p><em><span>Note: &nbsp;</span></em><span>a \"parent\" of your parent can also include his or her step-parent, as long as that step-parent was married to your parent's natural parent before your parent turned 18. &nbsp;Also, \"your&nbsp;parent\" can also include your step-parent, as long as that step-parent was married to your natural parent before you turned 18. &nbsp;</span><span><br /> <br /> <span>It's very well possible that your parent may have a parent, sibling or employer, where any of them (or all) could petition for your parent, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your parent rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your parent is a Mexican citizen, a petition by your parent's sibling for him or her is moving faster than one by his or her parent by a few years.</span></span></p>",

  "P61_H7_TITLE": "Unfortunately, the petition filed by your grandparent for your parent in the F2A category has been invalidated because your parent is now married and your grandparent is unwilling or unable to file for citizenship.  A new I-130 petition with a new priority date would have to be filed for your parent by a new relative.\n If your other grandparent is a citizen he or she should file a new petition for your parent in the F3 category (married sons/daughters of citizens). \nIf your parent has a citizen sibling 21 or over, he or she can file a new petition for your parent in the F4 category. \nIf your parent has a US employer willing to sponsor him or her, it can file a labor certification for your parent (if one is necessary), then an I-140 petition for him or her in an employment category.",
  "P61_H7_TITLE_BODY":"<p><em><span>Note: &nbsp;</span></em><span>a \"parent\" of your parent can also include his or her step-parent, as long as that step-parent was married to your parent's natural parent before your parent turned 18. &nbsp;Also, \"your&nbsp;parent\" can also include your step-parent, as long as that step-parent was married to your natural parent before you turned 18. &nbsp;</span><span><br /> <br /> <span>It's very well possible that your parent may have a parent, sibling or employer, where any of them (or all) could petition for your parent, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your parent rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your parent is a Mexican citizen, a petition by your parent's sibling for him or her is moving faster than one by his or her parent by a few years.</span></span></p>",

  "P61_H8_TITLE": "Have such grandparent or aunt or uncle of yours file I-130 petition for your parent, OR \nHave US employer file labor certification for your parent (if necessary and one hasn't been filed yet) and get that certified, then an I-140 petition for your parent.",

  "P61_H9_TITLE": "Sorry:  it's not possible to immigrate as a derivative of your parent.",

  "P61_H10_TITLE": "Since you are or will be 21 or over, compute your 'effective age' as follows:  (1) determine your age on the date when a visa number became or will become available for your parent (which is the date in the Visa Bulletin when the priority date of the petition filed for your parent became or will become current or the petition's approval date itself, whichever is later), then (2) reduce that age by the number of days the petition was or will be pending. ",

  "P61_H11_TITLE": "We're examining remaining possibilities for you to get your green card.",

  "P61_OV1_TITLE": "Have parent file for green card.  After parent obtained green card, restart and run the app with this new info (parent has green card).  Or, restart the app now and run it with the new info to see what's possible for you.",

  "P61_OV2_TITLE": "Since you will be out of status in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card) either concurrently with parent's application or shortly after, and only as a dependent of parent.  If out of status for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval if have green card parent (who got green card approved before you), before going back to home country.  If no such parent, will be subject to 3- or 10-year bar. ",
  "P61_OV2_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em><span>not</span></em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.).</span><span><br /> <br /> <em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must take the step to obtain the immigrant visa&nbsp;<em><span>within one year after</span></em>&nbsp;the&nbsp;date when a visa number became or will become available for your parent under the appropriate category.</span></span></p>",

  "P61_OV3_TITLE": "File I-485 and I-485A applications for green card as a dependent only together with parent's I-485.",
  "P61_OV3_TITLE_BODY":"<p><em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must file the I-485 application&nbsp;<em><span>within one year after</span></em>&nbsp;the&nbsp;date when a visa number became or will become available for your parent under the appropriate category.</span></p>",

  "P61_OV4_TITLE": "File I-485 application for green card as a dependent only together with parent's I-485.",
  "P61_OV4_TITLE_BODY":"<p><em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must file the I-485 application&nbsp;<em><span>within one year after</span></em>&nbsp;the&nbsp;date when a visa number became or will become available for your parent under the appropriate category.</span></p>",


  "P62_D1_TITLE": "Has your parent been petitioned for in the past for green card or immigrant status by his or her US citizen/green card parent (your grandparent), citizen sibling (your aunt or uncle), with filing of an I-130 petition, or US employer with filing of a labor certification and an I-140 petition, and in any case the filing occurred before you turned 21?",
  "P62_D1_TITLE_BODY":"<p><em><span>Note: &nbsp;</span></em><span>a \"parent\" of your parent can also include his or her step-parent, as long as that step-parent was married to your parent's natural parent before your parent turned 18. &nbsp;Also, \"your&nbsp;parent\" can also include your step-parent, as long as that step-parent was married to your natural parent before you turned 18.</span></p>",

  "P62_D2_TITLE": "Is your parent now married?",
  "P62_D2_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;your parent being now married will automatically convert the petition filed for him or her in the F1 category (unmarried sons/daughters of citizens) to F3 (married sons/daughters of citizens), which may be a slower or faster category with the priority date. &nbsp;This can be confirmed by checking the Visa Bulletin. &nbsp;Conversely, if the petition filed for him or her was in the F3 category, your parent being now unmarried will automatically convert the petition to F1.</span><span><br /> <br /> <span>If the petition filed for your parent by your grandparent was in the F2A or F2B category, it may now be invalid because your parent is married, and therefore the early priority date of that petition from before cannot be taken advantage of. &nbsp;A new petition with a new priority date would have to be filed for your parent, unless your grandparent already is or can now become a citizen and the petition was F2A category,&nbsp;in which case the old petition would still be valid and converted to the F3 category with the old priority date preserved.</span></span></p>",

  "P62_D3_TITLE": "Is that grandparent a US citizen now?",

  "P62_D4_TITLE": "Did that grandparent become citizen when your parent was still under 21?",

  "P62_D5_TITLE": "Did your parent marry before your grandparent became citizen?",
  "P62_D5_TITLE_BODY":"If the petition filed for your parent by your grandparent was in the F2B category (unmarried son/daughter 21 and over of green-card holder), unfortunately it would be invalid if your parent got married before your grandparent became a citizen.",

  "P62_D6_TITLE": "Would that grandparent apply for citizenship if qualified to do so at this time (had green card for at least 5 years, or 3 in some cases) or in the future?",
  "P62_D6_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;because your parent is now married, your grandparent having citizenship rather than just green card will prevent the petition filed for your parent from being invalidated. &nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history.</span></p>",

  "P62_D7_TITLE": "Does parent have any US citizen/green card parent (your grandparent), citizen sibling 21 or over (your aunt or uncle), or US employer willing to file an I-130 or I-140 petition for him or her?",
  "P62_D7_TITLE_BODY":"<p><em><span>Note: &nbsp;</span></em><span>a \"parent\" of your parent can also include his or her step-parent, as long as that step-parent was married to your parent's natural parent before your parent turned 18. &nbsp;Also, \"your&nbsp;parent\" can also include your step-parent, as long as that step-parent was married to your natural parent before you turned 18. &nbsp;</span><span><br /> <br /> <span>If your grandparent has a green card, he or she can only petition for your parent if your parent is unmarried. &nbsp;There is no category for green-card holders to petition for their married children.<em><br /> <br /> </em>It's very well possible that your parent may have a parent, sibling or employer, where any of them (or all) could petition for your parent, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your parent rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your parent is a Mexican citizen, a petition by your parent's sibling for him or her is moving faster than one by his or her parent by a few years.&nbsp;</span></span></p>",

  "P62_D8_TITLE": "Will your age still be or was under 21 by that time?",

  "P62_D9_TITLE": "Is your effective age just computed under 21?",

  "P62_D10_TITLE": "Did your parent already receive his/her green card and you were unable to immigrate with them?",
  "P62_D10_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;If yes, then most likely when your parent was ready for the final processing step to immigrate to the US (receive the green card), you were 21 or over, or \"aged out,\" and were found to be no longer eligible to accompany your parent to immigrate.</span><span><br /> <br /> <span>Also, please keep in mind that if your parent has already received green card then in the previous step in this app you were asked about whether that parent has already petitioned directly for you or asked about that parent possibly petitioning for you.</span></span></p>",

  "P62_D11_TITLE": "Look back at the date when a visa number became available for your parent (which is the date in the Visa Bulletin when the priority date of the petition filed for your parent became current or the petition's approval date itself, whichever is later).  Are you here at this app one year or less after that date?",

  "P62_D12_TITLE": "Are you from Mexico?",
  "P62_D12_TITLE_BODY":"If you are from Mexico, you could benefit from having a check on whether you have a US citizen sibling in the next step, since for Mexicans the F4 category of siblings is moving a few years faster than the one where you are petitioned for by your parent.",

  "P62_OC1_TITLE": "Was petition filed for your parent in the following way (choose one)?",
  "P62_OC1_OPTIONA":"By grandparent who had green card and parent was under 21 and unmarried at the time (petition under F2A category)",
  "P62_OC1_OPTIONB":"By grandparent who had green card and parent was 21 or over and unmarried at the time (petition under F2B category)",
  "P62_OC1_OPTIONC":"By grandparent who was a citizen and parent was 21 or over and unmarried at the time (petition under F1 category)",
  "P62_OC1_OPTIOND":"By grandparent who was a citizen and parent was married at the time (petition under F3 category)",
  "P62_OC1_OPTIONE":"By parent's sibling who was a citizen 21 or over at the time (petition under F4 category) or by US employer",
  "P62_OC1_TITLE_NOTE":"<p><em><span>Note</span></em><span>: &nbsp;if it's actually your step-parent we're dealing with, then by the term \"grandparent\"&nbsp;it's understood that we're actually referring to your step-parent's parent&nbsp;or even your step-parent's step-parent.</span></p>",

  "P62_H1_TITLE": "The petition filed by grandparent for your parent has been converted to an immediate relative petition.  Unfortunately, that petition can only help or did help your parent to immigrate but not you.",

  "P62_H2_TITLE": "The petition filed by grandparent for your parent has been converted to the F3 category (married sons/daughters of citizens). ",

  "P62_H3_TITLE": "The petition filed by grandparent for your parent has been converted to the F1 category (unmarried sons/daughters 21 or over of citizens).",

  "P62_H4_TITLE": "Have grandparent file N-400 application to become US citizen and wait until approval.",

  "P62_H5_TITLE": "Wait until the petition for your parent is approved and has priority date current under the appropriate category (unless it's already approved and has priority date current).  Then, estimate or take note of what your age at that time will be (or was if the priority date already current).",
  "P62_H5_TITLE_BODY":"<p><span>F1 category = unmarried sons/daughters (21 or over) of citizens</span><span><br /> <span>F2A = spouses and unmarried children (less than 21) of green-card holders</span><br /> <span>F2B = unmarried sons/daughters (21 or over) of green-card holders</span><br /> <span>F3 = married sons/daughters of citizens</span><br /> <span>F4 = siblings of 21 or over citizens</span><br /> <br /> <span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your parent's petition's priority date, the sooner there will be a visa number available for him or her. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.&nbsp;&nbsp;&nbsp;&nbsp;</span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between your parent and petitioner (his or her parent or sibling or employer here) exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span><br /> <br /> <em><span>Tip</span></em><span>: &nbsp;If the I-130 was filed for your parent by your grandparent under F2B category, and while waiting for the &nbsp;priority date to be current, have grandparent file to become citizen if priority dates move faster under F1 category. &nbsp;If grandparent files for citizenship anyway, your parent will be automatically converted from F2B to F1, but your parent has the right to 'opt out' and stay in F2B if priority dates are moving faster with F2B.</span></span></p>",

  "P62_H6_TITLE": "Unfortunately, the petition filed by your grandparent for parent in the F2B category has been invalidated because your parent married before your grandparent became a citizen.  A new I-130 petition with a new priority date would have to be filed for your parent. \nIf that same grandparent has had a green card for at least 5 yrs (3 in some cases), he or she should file an N-400 application to become a citizen then afterward file a new petition for your parent under the F3 category (married sons/daughters of citizens).  If that same grandparent is already a citizen, he or she should file a new petition for your parent under F3.  If your other grandparent is a citizen he or she can also file a new petition for your parent under F3, not to mention your other set of grandparents who could petition for your other parent. \nIf your parent has a citizen sibling 21 or over, he or she can file a new petition for your parent in the F4 category. \nIf your parent has a US employer willing to sponsor him or her, it can file a labor certification for your parent (if one is necessary), then an I-140 petition for him or her in an employment category.",
  "P62_H6_TITLE_BODY":"<p><em><span>Note: &nbsp;</span></em><span>a \"parent\" of your parent can also include his or her step-parent, as long as that step-parent was married to your parent's natural parent before your parent turned 18. &nbsp;Also, \"your&nbsp;parent\" can also include your step-parent, as long as that step-parent was married to your natural parent before you turned 18. &nbsp;</span><span><br /> <br /> <span>It's very well possible that your parent may have a parent, sibling or employer, where any of them (or all) could petition for your parent, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your parent rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your parent is a Mexican citizen, a petition by your parent's sibling for him or her is moving faster than one by his or her parent by a few years.</span></span></p>",

  "P62_H7_TITLE": "Unfortunately, the petition filed by your grandparent for your parent in the F2A category has been invalidated because your parent is now married and your grandparent is unwilling or unable to file for citizenship.  A new I-130 petition with a new priority date would have to be filed for your parent by a new relative. \nIf your other grandparent is a citizen he or she should file a new petition for your parent in the F3 category (married sons/daughters of citizens). \nIf your parent has a citizen sibling 21 or over, he or she can file a new petition for your parent in the F4 category. \nIf your parent has a US employer willing to sponsor him or her, it can file a labor certification for your parent (if one is necessary), then an I-140 petition for him or her in an employment category.",
  "P62_H7_TITLE_BODY":"<p><em><span>Note: &nbsp;</span></em><span>a \"parent\" of your parent can also include his or her step-parent, as long as that step-parent was married to your parent's natural parent before your parent turned 18. &nbsp;Also, \"your&nbsp;parent\" can also include your step-parent, as long as that step-parent was married to your natural parent before you turned 18. &nbsp;</span><span><br /> <br /> <span>It's very well possible that your parent may have a parent, sibling or employer, where any of them (or all) could petition for your parent, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your parent rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your parent is a Mexican citizen, a petition by your parent's sibling for him or her is moving faster than one by his or her parent by a few years.</span></span></p>",

  "P62_H8_TITLE": "Have such grandparent or aunt or uncle of yours file I-130 petition for your parent, OR \nHave US employer file labor certification for your parent (if necessary and one hasn't been filed yet) and get that certified, then an I-140 petition for your parent.",

  "P62_H9_TITLE": "Sorry:  it's not possible to immigrate as a derivative of your parent.",

  "P62_H10_TITLE": "Since you are or will be 21 or over, compute your 'effective age' as follows:  (1) determine your age on the date when a visa number became or will become available for your parent (which is the date in the Visa Bulletin when the priority date of the petition filed for your parent became or will become current or the petition's approval date itself, whichever is later), then (2) reduce that age by the number of days the petition was or will be pending.",

  "P62_H11_TITLE": "We're examining remaining possibilities for you to get your green card.",

  "P62_OV1_TITLE": "Have parent file for green card.  After parent obtained green card, restart and run the app with this new info (parent has green card).  Or, restart the app now and run it with the new info to see what's possible for you.",

  "P62_OV2_TITLE": "File I-485 and I-485A applications for green card as a dependent only together with parent's I-485.",
  "P62_OV2_TITLE_BODY":"<p><em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must file the I-485 application&nbsp;<em>within one year after</em>&nbsp;the&nbsp;date when a visa number became or will become available for your parent under the appropriate category.</span></p>",

  "P62_OV3_TITLE": "Since you are out of status/unlawfully present in the US, you must go through consular processing and interview in your home country to obtain immigrant visa (green card) either concurrently with parent's application or shortly after, and only as a dependent of parent.  If out of status/unlawfully present for more than 180 days, you must also file I-601A waiver application here first to waive 3- or 10-year bar and wait for its approval if have green card parent (who got green card approved before you), before going back to home country.  If no such parent, will be subject to 3- or 10-year bar.",
  "P62_OV3_TITLE_BODY":"<p><em><span>Note</span></em><span>: &nbsp;if by the time you leave the US for the interview you will still be 18 years and 180 days old or less, you will&nbsp;<em><span>not</span></em>&nbsp;be subject to the 3-year bar and will not have to file the I-601A waiver (unless you have other inadmissibility problems such as criminal convictions or more than one prior entries into US without inspection, etc.).</span><span><br /> <br /> <em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must take the step to obtain the immigrant visa&nbsp;<em><span>within one year after</span></em>&nbsp;the&nbsp;date when a visa number became or will become available for your parent under the appropriate category.</span></span></p>",


  "P63_D1_TITLE": "Has your parent been petitioned for in the past for green card or immigrant status by his or her US citizen/green card parent (your grandparent), citizen sibling (your aunt or uncle), with filing of an I-130 petition, or US employer with filing of a labor certification and an I-140 petition, and in any case the filing occurred before you turned 21?",
  "P63_D1_TITLE_BODY": "<p><em><span>Note: &nbsp;</span></em><span>a \"parent\" of your parent can also include his or her step-parent, as long as that step-parent was married to your parent's natural parent before your parent turned 18. &nbsp;Also, \"your&nbsp;parent\" can also include your step-parent, as long as that step-parent was married to your natural parent before you turned 18. &nbsp;</span></p>",

  "P63_D2_TITLE": "Is your parent now married?",
  "P63_D2_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;your parent being now married will automatically convert the petition filed for him or her in the F1 category (unmarried sons/daughters of citizens) to F3 (married sons/daughters of citizens), which may be a slower or faster category with the priority date. &nbsp;This can be confirmed by checking the Visa Bulletin. &nbsp;Conversely, if the petition filed for him or her was in the F3 category, your parent being now unmarried will automatically convert the petition to F1.</span><span><br /> <br /> <span>If the petition filed for your parent by your grandparent was in the F2A or F2B category, it may now be invalid because your parent is married, and therefore the early priority date of that petition from before cannot be taken advantage of. &nbsp;A new petition with a new priority date would have to be filed for your parent, unless your grandparent already is or can now become a citizen and the petition was F2A category,&nbsp;in which case the old petition would still be valid and converted to the F3 category with the old priority date preserved.</span></span></p>",

  "P63_D3_TITLE": "Is that grandparent a US citizen now?",

  "P63_D4_TITLE": "Did that grandparent become citizen when your parent was still under 21?",

  "P63_D5_TITLE": "Did your parent marry before your grandparent became citizen?",
  "P63_D5_TITLE_BODY": "If the petition filed for your parent by your grandparent was in the F2B category (unmarried son/daughter 21 and over of green-card holder), unfortunately it would be invalid if your parent got married before your grandparent became a citizen.",

  "P63_D6_TITLE": "Would that grandparent apply for citizenship if qualified to do so at this time (had green card for at least 5 years, or 3 in some cases) or in the future?",
  "P63_D6_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;because your parent is now married, your grandparent having citizenship rather than just green card will prevent the petition filed for your parent from being invalidated. &nbsp;However, sometimes a person with green card may&nbsp;<em><span>not</span></em>&nbsp;wish to apply or&nbsp;<em><span>not</span></em>&nbsp;be eligible for citizenship due to various reasons, such as fear they may denied due to certain criminal history.</span></p>",

  "P63_D7_TITLE": "Does parent have any US citizen/green card parent (your grandparent), citizen sibling 21 or over (your aunt or uncle), or US employer willing to file an I-130 or I-140 petition for him or her?",
  "P63_D7_TITLE_BODY": "<p><em><span>Note: &nbsp;</span></em><span>a \"parent\" of your parent can also include his or her step-parent, as long as that step-parent was married to your parent's natural parent before your parent turned 18. &nbsp;Also, \"your&nbsp;parent\" can also include your step-parent, as long as that step-parent was married to your natural parent before you turned 18. &nbsp;</span><span><br /> <br /> <span>If your grandparent has a green card, he or she can only petition for your parent if your parent is unmarried. &nbsp;There is no category for green-card holders to petition for their married children.<em><br /> <br /> </em>It's very well possible that your parent may have a parent, sibling or employer, where any of them (or all) could petition for your parent, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your parent rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your parent is a Mexican citizen, a petition by your parent's sibling for him or her is moving faster than one by his or her parent by a few years.&nbsp;</span></span></p>",

  "P63_D8_TITLE": "Will your age still be or was under 21 by that time? ",

  "P63_D9_TITLE": "Is your effective age just computed under 21?",

  "P63_D10_TITLE": "Did your parent already receive his/her green card and you were unable to immigrate with them?",
  "P63_D10_TITLE_BODY": "<p><em><span>Note</span></em><span>: &nbsp;If yes, then most likely when your parent was ready for the final processing step to immigrate to the US (receive the green card), you were 21 or over, or \"aged out,\" and were found to be no longer eligible to accompany your parent to immigrate.</span><span><br /> <br /> <span>Also, please keep in mind that if your parent has already received green card then in the previous step in this app you were asked about whether that parent has already petitioned directly for you or asked about that parent possibly petitioning for you.</span></span></p>",

  "P63_D11_TITLE": "Look back at the date when a visa number became available for your parent (which is the date in the Visa Bulletin when the priority date of the petition filed for your parent became current or the petition's approval date itself, whichever is later).  Are you here at this app one year or less after that date?",

  "P63_D12_TITLE": "Are you from Mexico?",
  "P63_D12_TITLE_BODY": "If you are from Mexico, you could benefit from having a check on whether you have a US citizen sibling in the next step, since for Mexicans the F4 category of siblings is moving a few years faster than the one where you are petitioned for by your parent.",

  "P63_OC1_TITLE": "Was petition filed for your parent in the following way (choose one)?",
  "P63_OC1_OPTIONA":"By grandparent who had green card and parent was under 21 and unmarried at the time (petition under F2A category)",
  "P63_OC1_OPTIONB":"By grandparent who had green card and parent was 21 or over and unmarried at the time (petition under F2B category)",
  "P63_OC1_OPTIONC":"By grandparent who was a citizen and parent was 21 or over and unmarried at the time (petition under F1 category)",
  "P63_OC1_OPTIOND":"By grandparent who was a citizen and parent was married at the time (petition under F3 category)",
  "P63_OC1_OPTIONE":"By parent's sibling who was a citizen 21 or over at the time (petition under F4 category) or by US employer",
  "P63_OC1_TITLE_NOTE":"<p><em><span>Note</span></em><span>: &nbsp;if it's actually your step-parent we're dealing with, then by the term \"grandparent\"&nbsp;it's understood that we're actually referring to your step-parent's parent&nbsp;or even your step-parent's step-parent.</span></p>",

  "P63_H1_TITLE": "The petition filed by grandparent for your parent has been converted to an immediate relative petition.  Unfortunately, that petition can only help or did help your parent to immigrate but not you.",

  "P63_H2_TITLE": "The petition filed by grandparent for your parent has been converted to the F3 category (married sons/daughters of citizens). ",

  "P63_H3_TITLE": "The petition filed by grandparent for your parent has been converted to the F1 category (unmarried sons/daughters 21 or over of citizens).",

  "P63_H4_TITLE": "Have grandparent file N-400 application to become US citizen and wait until approval.",

  "P63_H5_TITLE": "Wait until the petition for your parent is approved and has priority date current under the appropriate category (unless it's already approved and has priority date current).  Then, estimate or take note of what your age at that time will be (or was if the priority date already current).",
  "P63_H5_TITLE_BODY": "<p><span>F1 category = unmarried sons/daughters (21 or over) of citizens</span><span><br /> <span>F2A = spouses and unmarried children (less than 21) of green-card holders</span><br /> <span>F2B = unmarried sons/daughters (21 or over) of green-card holders</span><br /> <span>F3 = married sons/daughters of citizens</span><br /> <span>F4 = siblings of 21 or over citizens</span><br /> <br /> <span>A petition's priority date is usually its filing date with USCIS. &nbsp;Since there is a limited number of visa numbers available each year in each category (except for immediate relative petitions), the earlier is your parent's petition's priority date, the sooner there will be a visa number available for him or her. &nbsp;That is, the further ahead in line the petition will be. &nbsp;When a petition's priority date is 'current', it means it's now the turn of that petition (along with other petitions with the same priority date) to have a visa number, i.e. they are at the head of the line and visa numbers are immediately available for those petitions. &nbsp;Only with a visa number available can you continue to the next step of securing a green card.&nbsp;&nbsp;&nbsp;&nbsp;</span><br /> <br /> <span>But even with a visa number available, the petition has to be 'approved' first. &nbsp;Being approved means that USCIS has found that the relationship claimed between your parent and petitioner (his or her parent or sibling or employer here) exists and is genuine. &nbsp;Usually, a petition will be approved long before its priority date becomes current.</span><br /> <br /> <em><span>Tip</span></em><span>: &nbsp;If the I-130 was filed for your parent by your grandparent under F2B category, and while waiting for the &nbsp;priority date to be current, have grandparent file to become citizen if priority dates move faster under F1 category. &nbsp;If grandparent files for citizenship anyway, your parent will be automatically converted from F2B to F1, but your parent has the right to 'opt out' and stay in F2B if priority dates are moving faster with F2B.</span></span></p>",

  "P63_H6_TITLE": "Unfortunately, the petition filed by your grandparent for parent in the F2B category has been invalidated because your parent married before your grandparent became a citizen.  A new I-130 petition with a new priority date would have to be filed for your parent. \nIf that same grandparent has had a green card for at least 5 yrs (3 in some cases), he or she should file an N-400 application to become a citizen then afterward file a new petition for your parent under the F3 category (married sons/daughters of citizens).  If that same grandparent is already a citizen, he or she should file a new petition for your parent under F3.  If your other grandparent is a citizen he or she can also file a new petition for your parent under F3, not to mention your other set of grandparents who could petition for your other parent. \nIf your parent has a citizen sibling 21 or over, he or she can file a new petition for your parent in the F4 category. \nIf your parent has a US employer willing to sponsor him or her, it can file a labor certification for your parent (if one is necessary), then an I-140 petition for him or her in an employment category.",
  "P63_H6_TITLE_BODY": "<p><em><span>Note: &nbsp;</span></em><span>a \"parent\" of your parent can also include his or her step-parent, as long as that step-parent was married to your parent's natural parent before your parent turned 18. &nbsp;Also, \"your&nbsp;parent\" can also include your step-parent, as long as that step-parent was married to your natural parent before you turned 18. &nbsp;</span><span><br /> <br /> <span>It's very well possible that your parent may have a parent, sibling or employer, where any of them (or all) could petition for your parent, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your parent rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your parent is a Mexican citizen, a petition by your parent's sibling for him or her is moving faster than one by his or her parent by a few years.</span></span></p>",

  "P63_H7_TITLE": "Unfortunately, the petition filed by your grandparent for your parent in the F2A category has been invalidated because your parent is now married and your grandparent is unwilling or unable to file for citizenship.  A new I-130 petition with a new priority date would have to be filed for your parent by a new relative. \nIf your other grandparent is a citizen he or she should file a new petition for your parent in the F3 category (married sons/daughters of citizens). \nIf your parent has a citizen sibling 21 or over, he or she can file a new petition for your parent in the F4 category. \nIf your parent has a US employer willing to sponsor him or her, it can file a labor certification for your parent (if one is necessary), then an I-140 petition for him or her in an employment category.",
  "P63_H7_TITLE_BODY": "<p><em><span>Note: &nbsp;</span></em><span>a \"parent\" of your parent can also include his or her step-parent, as long as that step-parent was married to your parent's natural parent before your parent turned 18. &nbsp;Also, \"your&nbsp;parent\" can also include your step-parent, as long as that step-parent was married to your natural parent before you turned 18. &nbsp;</span><span><br /> <br /> <span>It's very well possible that your parent may have a parent, sibling or employer, where any of them (or all) could petition for your parent, but usually it will be the person whose category moves faster. &nbsp;Almost always that would be a parent petitioning for your parent rather than a sibling, although an employment petition could sometime move even faster than a parent's,&nbsp;although the Visa Bulletin has to be checked to make sure. &nbsp;Mexico is a very notable exception currently: &nbsp;if your parent is a Mexican citizen, a petition by your parent's sibling for him or her is moving faster than one by his or her parent by a few years.</span></span></p>",

  "P63_H8_TITLE": "Have such grandparent or aunt or uncle of yours file I-130 petition for your parent, OR \nHave US employer file labor certification for your parent (if necessary and one hasn't been filed yet) and get that certified, then an I-140 petition for your parent.",

  "P63_H9_TITLE": "Sorry:  it's not possible to immigrate as a derivative of your parent.",

  "P63_H10_TITLE": "Since you are or will be 21 or over, compute your 'effective age' as follows:  (1) determine your age on the date when a visa number became or will become available for your parent (which is the date in the Visa Bulletin when the priority date of the petition filed for your parent became or will become current or the petition's approval date itself, whichever is later), then (2) reduce that age by the number of days the petition was or will be pending.",

  "P63_H11_TITLE": "We're examining remaining possibilities for you to get your green card.",

  "P63_OV1_TITLE": "Have parent file for green card.  After parent obtained green card, restart and run the app with this new info (parent has green card).  Or, restart the app now and run it with the new info to see what's possible for you.",

  "P63_OV2_TITLE": "You go through consular processing and interview in your home country to receive immigrant visa (green card) only as a dependent together with parent's immigrant visa application.",
  "P63_OV2_TITLE_BODY": "<p><em><span>Importan</span></em><span>t: &nbsp;if you've arrived at this step after having computed your effective age to be under 21, you must take the step to obtain the immigrant visa&nbsp;<em><span>within one year after</span></em>&nbsp;the&nbsp;date when a visa number became or will become available for your parent under the appropriate category.</span></p>"
}
